#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.infrastructure.vcd_lb_app_profile.tcp: Refreshing state... [id=applicationProfile-2]
module.infrastructure.vcd_nsxv_firewall_rule.k8s_network: Refreshing state... [id=131084]
module.infrastructure.data.vcd_edgegateway.k8s_gateway: Reading...
module.infrastructure.vcd_catalog.k8s_catalog: Refreshing state... [id=urn:vcloud:catalog:d5d81d70-89df-4e2f-b0d1-414349ae09d6]
module.infrastructure.vcd_nsxv_firewall_rule.k8s_internal: Refreshing state... [id=131086]
module.infrastructure.vcd_lb_service_monitor.k8s_tcp_monitor: Refreshing state... [id=monitor-5]
module.infrastructure.vcd_nsxv_firewall_rule.k8s_external: Refreshing state... [id=131083]
module.infrastructure.vcd_catalog_item.k8s_item: Refreshing state... [id=urn:vcloud:catalogitem:cf30ba5a-259f-44dd-b1be-ed8ab8bfa15c]
module.infrastructure.vcd_lb_server_pool.k8s_api_pool: Refreshing state... [id=pool-4]
module.infrastructure.vcd_lb_server_pool.k8s_http_pool: Refreshing state... [id=pool-6]
module.infrastructure.vcd_lb_server_pool.k8s_https_pool: Refreshing state... [id=pool-5]
module.infrastructure.data.vcd_edgegateway.k8s_gateway: Read complete after 7s [id=urn:vcloud:gateway:97fbc880-75c2-4c1e-8043-79282216f37d]
module.infrastructure.vcd_nsxv_firewall_rule.k8s_bastion_ssh: Refreshing state... [id=131088]
module.infrastructure.vcd_nsxv_firewall_rule.k8s_web_ingress: Refreshing state... [id=131082]
module.infrastructure.vcd_nsxv_firewall_rule.k8s_apiserver: Refreshing state... [id=131085]
module.infrastructure.vcd_nsxv_firewall_rule.k8s_nodeports: Refreshing state... [id=131087]
module.infrastructure.vcd_edgegateway_settings.k8s_gateway: Refreshing state... [id=urn:vcloud:gateway:97fbc880-75c2-4c1e-8043-79282216f37d]
module.infrastructure.vcd_lb_virtual_server.k8s_https_vs: Refreshing state... [id=virtualServer-5]
module.infrastructure.vcd_lb_virtual_server.k8s_api_vs: Refreshing state... [id=virtualServer-4]
module.infrastructure.vcd_lb_virtual_server.k8s_http_vs: Refreshing state... [id=virtualServer-6]
module.infrastructure.vcd_network_routed_v2.k8s_network: Refreshing state... [id=urn:vcloud:network:fd23a2b1-3347-4120-8707-60c124d38fb6]
module.infrastructure.vcd_nsxv_snat.outbound: Refreshing state... [id=196617]
module.infrastructure.vcd_vapp.k8s_vapp: Refreshing state... [id=urn:vcloud:vapp:8f76b5b6-d8a3-4958-b7d6-132c09a875d0]
module.infrastructure.vcd_nsxv_dnat.bastion_ssh: Refreshing state... [id=196618]
module.infrastructure.vcd_vapp_org_network.k8s_org_network: Refreshing state... [id=urn:vcloud:network:203b1e57-54ca-45dc-ad5f-39aaf2d410c3]
module.infrastructure.vcd_nsxv_snat.hairpin: Refreshing state... [id=196619]
module.infrastructure.vcd_vapp_vm.k8s_bastion: Refreshing state... [id=urn:vcloud:vm:f8026245-3559-4f2d-aa13-da4d921d3c7d]
module.infrastructure.null_resource.k8s_bastion_automatic_upgrades: Refreshing state... [id=5207000171431055426]
module.infrastructure.vcd_vapp_vm.k8s_control_plane[0]: Refreshing state... [id=urn:vcloud:vm:58dbc3ee-c415-4914-89a4-713b2a2a2701]
module.infrastructure.vcd_vapp_vm.k8s_control_plane[1]: Refreshing state... [id=urn:vcloud:vm:12c70c38-e7c0-4a2f-a1d8-df9cdeba588d]
module.infrastructure.vcd_vapp_vm.k8s_control_plane[2]: Refreshing state... [id=urn:vcloud:vm:faa73b4c-c212-4a03-bcfd-899709a1ab9d]
module.infrastructure.null_resource.k8s_control_plane_automatic_upgrades[0]: Refreshing state... [id=5732888809933245034]
module.infrastructure.null_resource.k8s_control_plane_automatic_upgrades[2]: Refreshing state... [id=4924871251685726894]
module.infrastructure.null_resource.k8s_control_plane_automatic_upgrades[1]: Refreshing state... [id=7263075097075655147]
module.infrastructure.vcd_vapp_vm.k8s_worker[0]: Refreshing state... [id=urn:vcloud:vm:c42d32e6-b6b7-4b26-bf7e-473bc52f0c1b]
module.infrastructure.vcd_vapp_vm.k8s_worker[2]: Refreshing state... [id=urn:vcloud:vm:b9a5924d-327d-4453-9ff7-47105bac3de9]
module.infrastructure.vcd_vapp_vm.k8s_worker[1]: Refreshing state... [id=urn:vcloud:vm:565d581a-c5a1-4a90-ab1b-e3bab9db2961]
module.infrastructure.null_resource.k8s_worker_automatic_upgrades[2]: Refreshing state... [id=791990002969907473]
module.infrastructure.null_resource.k8s_worker_automatic_upgrades[1]: Refreshing state... [id=632228242626053050]
module.infrastructure.null_resource.k8s_worker_automatic_upgrades[0]: Refreshing state... [id=7280627620863884303]
module.infrastructure.null_resource.k8s_nodes: Refreshing state... [id=8154590360623275946]
time_sleep.wait_for_infrastructure: Refreshing state... [id=2022-09-08T20:43:10Z]
module.kubernetes.module.k3s.tls_private_key.kubernetes_ca[0]: Refreshing state... [id=d07895ac83aa8ff61741ea0fdbf2604bbe6f7a3d]
module.kubernetes.module.k3s.tls_private_key.master_user[0]: Refreshing state... [id=2ad61dfbe80b3d4f4c8f10fa396949f35c9d2c3e]
module.kubernetes.module.k3s.tls_private_key.kubernetes_ca[2]: Refreshing state... [id=6596dca777aa260a714f4708354eb180f86ad299]
module.kubernetes.module.k3s.random_password.k3s_cluster_secret: Refreshing state... [id=none]
module.kubernetes.module.k3s.tls_private_key.kubernetes_ca[1]: Refreshing state... [id=def983ddede766ca77be8881ab4d3fb1e22fa34f]
module.kubernetes.module.k3s.tls_cert_request.master_user[0]: Refreshing state... [id=9388ca3e97a51cc0d4e5cad222dfbbea6de7e5e5]
module.kubernetes.module.k3s.tls_self_signed_cert.kubernetes_ca_certs["1"]: Refreshing state... [id=117641192481118231583360300256250814205]
module.kubernetes.module.k3s.tls_self_signed_cert.kubernetes_ca_certs["0"]: Refreshing state... [id=213857206107950977196586573133754300239]
module.kubernetes.module.k3s.tls_self_signed_cert.kubernetes_ca_certs["2"]: Refreshing state... [id=56883834180758922053257522777470487774]
module.kubernetes.module.k3s.null_resource.k8s_ca_certificates_install[5]: Refreshing state... [id=6341497637776888460]
module.kubernetes.module.k3s.tls_locally_signed_cert.master_user[0]: Refreshing state... [id=50255345233137816024597287725802850133]
module.kubernetes.module.k3s.null_resource.k8s_ca_certificates_install[1]: Refreshing state... [id=2666607920013175855]
module.kubernetes.module.k3s.null_resource.k8s_ca_certificates_install[2]: Refreshing state... [id=7057747877227843667]
module.kubernetes.module.k3s.null_resource.k8s_ca_certificates_install[3]: Refreshing state... [id=7525189447466732133]
module.kubernetes.module.k3s.null_resource.k8s_ca_certificates_install[0]: Refreshing state... [id=5176503017696586447]
module.kubernetes.module.k3s.null_resource.k8s_ca_certificates_install[4]: Refreshing state... [id=6326784543427902432]
module.kubernetes.module.k3s.null_resource.servers_install["k8s-server-0"]: Refreshing state... [id=1699797033353257846]
module.kubernetes.module.k3s.null_resource.servers_install["k8s-server-1"]: Refreshing state... [id=7908976907538464241]
module.kubernetes.module.k3s.null_resource.servers_install["k8s-server-2"]: Refreshing state... [id=5786231730004158294]
module.kubernetes.local_sensitive_file.kubeconfig_file: Refreshing state... [id=733a267ab25ec5d2152003b9a15216036fdb8e66]
module.kubernetes.module.k3s.null_resource.agents_install["k8s-worker-2"]: Refreshing state... [id=3879558826205646137]
module.kubernetes.module.k3s.null_resource.servers_annotation["k8s-server-1|dcs.kubernetes.io/release"]: Refreshing state... [id=8550032662401960497]
module.kubernetes.module.k3s.null_resource.servers_annotation["k8s-server-0|server.index"]: Refreshing state... [id=8463878403332409851]
module.kubernetes.module.k3s.null_resource.agents_install["k8s-worker-0"]: Refreshing state... [id=2785039167403387815]
module.kubernetes.module.k3s.null_resource.servers_label["k8s-server-1|node.kubernetes.io/type"]: Refreshing state... [id=7092461729410072116]
module.kubernetes.module.k3s.null_resource.agents_install["k8s-worker-1"]: Refreshing state... [id=3969423651348004298]
module.kubernetes.module.k3s.null_resource.servers_drain["k8s-server-0"]: Refreshing state... [id=809272999487548881]
module.kubernetes.module.k3s.null_resource.servers_annotation["k8s-server-1|server.index"]: Refreshing state... [id=7465089799278925088]
module.kubernetes.module.k3s.null_resource.servers_annotation["k8s-server-2|dcs.kubernetes.io/release"]: Refreshing state... [id=376322403311832429]
module.kubernetes.module.k3s.null_resource.servers_annotation["k8s-server-2|server.index"]: Refreshing state... [id=499979252358877442]
module.kubernetes.module.k3s.null_resource.servers_annotation["k8s-server-0|dcs.kubernetes.io/release"]: Refreshing state... [id=1679608701278940124]
module.kubernetes.module.k3s.null_resource.servers_label["k8s-server-2|node.kubernetes.io/type"]: Refreshing state... [id=6537709572536259408]
module.kubernetes.module.k3s.null_resource.agents_annotation["k8s-worker-1|dcs.kubernetes.io/release"]: Refreshing state... [id=5019396954875811412]
module.kubernetes.module.k3s.null_resource.servers_drain["k8s-server-1"]: Refreshing state... [id=5494754209027188595]
module.kubernetes.module.k3s.null_resource.agents_annotation["k8s-worker-2|worker.index"]: Refreshing state... [id=4410600840875992033]
module.kubernetes.module.k3s.null_resource.servers_drain["k8s-server-2"]: Refreshing state... [id=6183292217416946458]
module.kubernetes.module.k3s.null_resource.servers_label["k8s-server-0|node.kubernetes.io/type"]: Refreshing state... [id=608004569189809935]
module.kubernetes.module.k3s.null_resource.agents_annotation["k8s-worker-2|dcs.kubernetes.io/release"]: Refreshing state... [id=1520083646120774343]
module.kubernetes.module.k3s.null_resource.agents_annotation["k8s-worker-1|worker.index"]: Refreshing state... [id=816541052590819568]
module.kubernetes.module.k3s.null_resource.agents_annotation["k8s-worker-0|dcs.kubernetes.io/release"]: Refreshing state... [id=4973313167930177016]
module.kubernetes.module.k3s.null_resource.agents_annotation["k8s-worker-0|worker.index"]: Refreshing state... [id=552976309678092786]
module.kubernetes.module.k3s.null_resource.agents_drain["k8s-worker-2"]: Refreshing state... [id=2388845074095638651]
module.kubernetes.module.k3s.null_resource.agents_drain["k8s-worker-0"]: Refreshing state... [id=7579745108437842114]
module.kubernetes.module.k3s.null_resource.agents_drain["k8s-worker-1"]: Refreshing state... [id=5585781799579516897]
module.kubernetes.module.k3s.null_resource.agents_label["k8s-worker-0|node.kubernetes.io/pool"]: Refreshing state... [id=5251625258455459056]
module.kubernetes.module.k3s.null_resource.agents_label["k8s-worker-1|node.kubernetes.io/pool"]: Refreshing state... [id=4879415759956784723]
module.kubernetes.module.k3s.null_resource.agents_label["k8s-worker-2|node.kubernetes.io/pool"]: Refreshing state... [id=1906748128151221734]
module.kubernetes.module.k3s.null_resource.kubernetes_ready: Refreshing state... [id=6251495524284031428]
module.kubernetes.time_sleep.wait_for_kubernetes: Refreshing state... [id=2022-09-08T20:46:04Z]
module.kubernetes.null_resource.k8s_cilium_install: Refreshing state... [id=6258389488070838576]
module.kubernetes.null_resource.k8s_cilium_status: Refreshing state... [id=8231247681956109520]
time_sleep.wait_for_kubernetes: Refreshing state... [id=2022-09-08T20:50:28Z]
module.deployments.time_sleep.wait_for_kubernetes: Refreshing state... [id=2022-09-08T20:50:58Z]
module.deployments.helm_release.ingress_nginx: Refreshing state... [id=ingress-controller]
module.deployments.helm_release.longhorn: Refreshing state... [id=longhorn]
module.deployments.helm_release.kured[0]: Refreshing state... [id=kured]
module.deployments.helm_release.cert_manager: Refreshing state... [id=cert-manager]
module.deployments.time_sleep.wait_for_longhorn: Refreshing state... [id=2022-09-15T15:32:15Z]
module.deployments.kubectl_manifest.cluster_issuer: Refreshing state... [id=/apis/cert-manager.io/v1/clusterissuers/lets-encrypt]
module.deployments.helm_release.loki[0]: Refreshing state... [id=loki]
module.deployments.helm_release.prometheus[0]: Refreshing state... [id=prometheus]
module.deployments.helm_release.kubernetes_dashboard: Refreshing state... [id=kubernetes-dashboard]
module.deployments.helm_release.grafana[0]: Refreshing state... [id=grafana]
module.deployments.helm_release.promtail[0]: Refreshing state... [id=promtail]
module.deployments.kubectl_manifest.kubernetes_dashboard_cluster_role_binding: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/kubernetes-dashboard]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.kubernetes.local_sensitive_file.kubeconfig_file has been deleted
  - resource "local_sensitive_file" "kubeconfig_file" {
      - content              = (sensitive value)
      - directory_permission = "0700" -> null
      - file_permission      = "0600" -> null
      - filename             = "kubeconfig" -> null
      - id                   = "733a267ab25ec5d2152003b9a15216036fdb8e66" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.deployments.helm_release.cert_manager will be updated in-place
  ~ resource "helm_release" "cert_manager" {
        id                         = "cert-manager"
        name                       = "cert-manager"
      ~ version                    = "v1.10.0" -> "v1.10.1"
        # (26 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.deployments.helm_release.promtail[0] will be updated in-place
  ~ resource "helm_release" "promtail" {
        id                         = "promtail"
        name                       = "promtail"
      ~ version                    = "6.6.1" -> "6.6.2"
        # (27 unchanged attributes hidden)
    }

  # module.infrastructure.vcd_vapp_vm.k8s_bastion will be updated in-place
  ~ resource "vcd_vapp_vm" "k8s_bastion" {
      ~ guest_properties               = {
          ~ "user-data"      = "I2Nsb3VkLWNvbmZpZwoKYm9vdGNtZDoKLSBwcmludGYgIltSZXNvbHZlXVxuRE5TPTguOC44LjgiID4gL2V0Yy9zeXN0ZW1kL3Jlc29sdmVkLmNvbmYKLSBbc3lzdGVtY3RsLCByZXN0YXJ0LCBzeXN0ZW1kLXJlc29sdmVkXQoKcHJlc2VydmVfaG9zdG5hbWU6IGZhbHNlCmhvc3RuYW1lOiBrdWJlcm5ldGVzLWRlbW8tYmFzdGlvbgoKc3NoX3B3YXV0aDogZmFsc2UKZGlzYWJsZV9yb290OiB0cnVlCgp1c2VyczoKLSBuYW1lOiBrdWJlcm5ldGVzCiAgZ3JvdXBzOiB1c2VycywgYWRtaW4KICBsb2NrX3Bhc3N3ZDogdHJ1ZQogIHN1ZG86IEFMTD0oQUxMKSBOT1BBU1NXRDpBTEwKICBzaGVsbDogL2Jpbi9iYXNoCiAgc3NoX2F1dGhvcml6ZWRfa2V5czoKICAtIHNzaC1yc2EgQUFBQUIzTnphQzF5YzJFQUFBQURBUUFCQUFBQmdRRGRHbkozeDZxOG53Tyt4WXhkV0NvU25sYkpYQllNTEZiRFM3MVhmc0dKNmpocW9qVGx5Y09vQjBDemxaSUttenJLdTRncHJWZ3FBeXVsRVhYTVNRVUlKc1huL3RzNm41dG5WcWdaOUhUSlNGRzhlRWZqbVBMOWlzVjM0ZUhMNGV4eCtOeWlMRFhhVUEza1VmTzFlNXVmNERyS294cWN1NWdVeWsvN24rTEp4Tmd5ZnpzVmxHVGY3dVlSMC9yUi9mdlYzYU0vVEVhbDBWaWROTWdFYWIvVlAxVzIrUjBvVkQxR1FHWjJYeFNXdVZlaHZKbC9OOGgrTzlUTms5R0NFOXRJTFpkWXVuRndlOS9vQ1JacXgyRHRhZTd1ZFZDY2NYK0dRMSt6MGlrdmp1TTNVNC9GOU5LcGx3NXpINm04TG9RZlhaQnkwb0dNVHpzMVFDb1RVSWFwb3B5YkNNcXJ3MExSL0pXRjY5cHVJL1pIcy9SVGdPaTVqTHAzSXBoNTIyN2JneGU2ZWFpZUYvUEl6TTM2cFB1RzRUVGJVUk5EQThwRUNDNnBpREp0VDcwaVF4RzJIRU9CQ3NWelN5Uk1CV0FNaUVaUm16YVE3SUQ5bWtnWTJWM1FMcXpWZlJPSDFLOFNJb3NLb1Y5eVpuQURBVzdZOFFGR2ZuLzJTN3IvemkwPSB0Z2RiZWZhM0BVTFhHV1AwMDcKCndyaXRlX2ZpbGVzOgotIHBhdGg6IC9ldGMvbmV0cGxhbi81MC1jbG91ZC1pbml0LnlhbWwKICBvd25lcjogcm9vdAogIGNvbnRlbnQ6IHwKICAgIG5ldHdvcms6CiAgICAgIHZlcnNpb246IDIKICAgICAgZXRoZXJuZXRzOgogICAgICAgIGV0aDA6CiAgICAgICAgICBtYXRjaDoKICAgICAgICAgICAgbmFtZTogZW4qCiAgICAgICAgICBhZGRyZXNzZXM6IFsxMC44MC4wLjIwLzI0XQogICAgICAgICAgZ2F0ZXdheTQ6IDEwLjgwLjAuMQogICAgICAgICAgZGhjcDY6IGZhbHNlCiAgICAgICAgICBuYW1lc2VydmVyczoKICAgICAgICAgICAgYWRkcmVzc2VzOiBbMS4xLjEuMSwgOC44LjguOF0KICAgICAgICAgIGRoY3A0OiBmYWxzZQoKcGFja2FnZV91cGRhdGU6IHRydWUKcGFja2FnZXM6Ci0gdW5hdHRlbmRlZC11cGdyYWRlcwotIGdpdAotIGpxCi0gdmltCi0gb3Blbi1pc2NzaQoKcnVuY21kOgotIG5ldHBsYW4gYXBwbHkKLSB1ZncgZGlzYWJsZQotIHN5c3RlbWN0bCBlbmFibGUgdW5hdHRlbmRlZC11cGdyYWRlcwotIHN5c3RlbWN0bCBlbmFibGUgaXNjc2lkLnNlcnZpY2UKLSBzeXN0ZW1jdGwgc3RhcnQgaXNjc2lkLnNlcnZpY2UKLSBtb3VudCBicGZmcyAtdCBicGYgL3N5cy9mcy9icGYK" -> "I2Nsb3VkLWNvbmZpZwoKYm9vdGNtZDoKLSBwcmludGYgIltSZXNvbHZlXVxuRE5TPTguOC44LjgiID4gL2V0Yy9zeXN0ZW1kL3Jlc29sdmVkLmNvbmYKLSBbc3lzdGVtY3RsLCByZXN0YXJ0LCBzeXN0ZW1kLXJlc29sdmVkXQoKcHJlc2VydmVfaG9zdG5hbWU6IGZhbHNlCmhvc3RuYW1lOiBrdWJlcm5ldGVzLWRlbW8tYmFzdGlvbgoKc3NoX3B3YXV0aDogZmFsc2UKZGlzYWJsZV9yb290OiB0cnVlCgp1c2VyczoKLSBuYW1lOiBrdWJlcm5ldGVzCiAgZ3JvdXBzOiB1c2VycywgYWRtaW4KICBsb2NrX3Bhc3N3ZDogdHJ1ZQogIHN1ZG86IEFMTD0oQUxMKSBOT1BBU1NXRDpBTEwKICBzaGVsbDogL2Jpbi9iYXNoCiAgc3NoX2F1dGhvcml6ZWRfa2V5czoKICAtIHNzaC1yc2EgQUFBQUIzTnphQzF5YzJFQUFBQURBUUFCQUFBQmdRRGRHbkozeDZxOG53Tyt4WXhkV0NvU25sYkpYQllNTEZiRFM3MVhmc0dKNmpocW9qVGx5Y09vQjBDemxaSUttenJLdTRncHJWZ3FBeXVsRVhYTVNRVUlKc1huL3RzNm41dG5WcWdaOUhUSlNGRzhlRWZqbVBMOWlzVjM0ZUhMNGV4eCtOeWlMRFhhVUEza1VmTzFlNXVmNERyS294cWN1NWdVeWsvN24rTEp4Tmd5ZnpzVmxHVGY3dVlSMC9yUi9mdlYzYU0vVEVhbDBWaWROTWdFYWIvVlAxVzIrUjBvVkQxR1FHWjJYeFNXdVZlaHZKbC9OOGgrTzlUTms5R0NFOXRJTFpkWXVuRndlOS9vQ1JacXgyRHRhZTd1ZFZDY2NYK0dRMSt6MGlrdmp1TTNVNC9GOU5LcGx3NXpINm04TG9RZlhaQnkwb0dNVHpzMVFDb1RVSWFwb3B5YkNNcXJ3MExSL0pXRjY5cHVJL1pIcy9SVGdPaTVqTHAzSXBoNTIyN2JneGU2ZWFpZUYvUEl6TTM2cFB1RzRUVGJVUk5EQThwRUNDNnBpREp0VDcwaVF4RzJIRU9CQ3NWelN5Uk1CV0FNaUVaUm16YVE3SUQ5bWtnWTJWM1FMcXpWZlJPSDFLOFNJb3NLb1Y5eVpuQURBVzdZOFFGR2ZuLzJTN3IvemkwPSB0Z2RiZWZhM0BVTFhHV1AwMDcKCndyaXRlX2ZpbGVzOgotIHBhdGg6IC9ldGMvbmV0cGxhbi81MC1jbG91ZC1pbml0LnlhbWwKICBvd25lcjogcm9vdAogIGNvbnRlbnQ6IHwKICAgIG5ldHdvcms6CiAgICAgIHZlcnNpb246IDIKICAgICAgZXRoZXJuZXRzOgogICAgICAgIGV0aDA6CiAgICAgICAgICBtYXRjaDoKICAgICAgICAgICAgbmFtZTogZW4qCiAgICAgICAgICBhZGRyZXNzZXM6IFsxMC44MC4wLjIwLzI0XQogICAgICAgICAgZ2F0ZXdheTQ6IDEwLjgwLjAuMQogICAgICAgICAgZGhjcDY6IGZhbHNlCiAgICAgICAgICBuYW1lc2VydmVyczoKICAgICAgICAgICAgYWRkcmVzc2VzOiBbMS4xLjEuMSwgOC44LjguOF0KICAgICAgICAgIGRoY3A0OiBmYWxzZQotIHBhdGg6IC9ldGMvc3lzY3RsLmQvNzcta3ViZXJuZXRlcy5jb25mCiAgb3duZXI6IHJvb3QKICBjb250ZW50OiB8CiAgICBuZXQuaXB2NC5pcF9mb3J3YXJkPTEKICAgIGZzLmlub3RpZnkubWF4X3VzZXJfd2F0Y2hlcz02NTUzNgogICAgZnMuaW5vdGlmeS5tYXhfdXNlcl9pbnN0YW5jZXM9ODE5MgotIHBhdGg6IC9ldGMvbG9ncm90YXRlLmQvcnN5c2xvZwogIG93bmVyOiByb290CiAgY29udGVudDogfAogICAgL3Zhci9sb2cvc3lzbG9nCiAgICAvdmFyL2xvZy9tYWlsLmluZm8KICAgIC92YXIvbG9nL21haWwud2FybgogICAgL3Zhci9sb2cvbWFpbC5lcnIKICAgIC92YXIvbG9nL21haWwubG9nCiAgICAvdmFyL2xvZy9kYWVtb24ubG9nCiAgICAvdmFyL2xvZy9rZXJuLmxvZwogICAgL3Zhci9sb2cvYXV0aC5sb2cKICAgIC92YXIvbG9nL3VzZXIubG9nCiAgICAvdmFyL2xvZy9scHIubG9nCiAgICAvdmFyL2xvZy9jcm9uLmxvZwogICAgL3Zhci9sb2cvZGVidWcKICAgIC92YXIvbG9nL21lc3NhZ2VzCiAgICB7CiAgICAgIHJvdGF0ZSA3CiAgICAgIGRhaWx5CiAgICAgIG1pc3NpbmdvawogICAgICBub3RpZmVtcHR5CiAgICAgIGNvbXByZXNzCiAgICAgIHNoYXJlZHNjcmlwdHMKICAgICAgcG9zdHJvdGF0ZQogICAgICAgIC91c3IvbGliL3JzeXNsb2cvcnN5c2xvZy1yb3RhdGUKICAgICAgZW5kc2NyaXB0CiAgICB9CgpwYWNrYWdlX3VwZGF0ZTogdHJ1ZQpwYWNrYWdlczoKLSB1bmF0dGVuZGVkLXVwZ3JhZGVzCi0gZ2l0Ci0ganEKLSB2aW0KLSBvcGVuLWlzY3NpCgpydW5jbWQ6Ci0gbmV0cGxhbiBhcHBseQotIHVmdyBkaXNhYmxlCi0gc3lzdGVtY3RsIGVuYWJsZSB1bmF0dGVuZGVkLXVwZ3JhZGVzCi0gc3lzdGVtY3RsIGVuYWJsZSBpc2NzaWQuc2VydmljZQotIHN5c3RlbWN0bCBzdGFydCBpc2NzaWQuc2VydmljZQotIG1vdW50IGJwZmZzIC10IGJwZiAvc3lzL2ZzL2JwZgo="
            # (2 unchanged elements hidden)
        }
        id                             = "urn:vcloud:vm:f8026245-3559-4f2d-aa13-da4d921d3c7d"
        name                           = "kubernetes-demo-bastion"
        # (21 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.infrastructure.vcd_vapp_vm.k8s_control_plane[0] will be updated in-place
  ~ resource "vcd_vapp_vm" "k8s_control_plane" {
      ~ guest_properties               = {
          ~ "user-data"      = "I2Nsb3VkLWNvbmZpZwoKYm9vdGNtZDoKLSBwcmludGYgIltSZXNvbHZlXVxuRE5TPTguOC44LjgiID4gL2V0Yy9zeXN0ZW1kL3Jlc29sdmVkLmNvbmYKLSBbc3lzdGVtY3RsLCByZXN0YXJ0LCBzeXN0ZW1kLXJlc29sdmVkXQoKcHJlc2VydmVfaG9zdG5hbWU6IGZhbHNlCmhvc3RuYW1lOiBrdWJlcm5ldGVzLWRlbW8tbWFzdGVyLTAKCnNzaF9wd2F1dGg6IGZhbHNlCmRpc2FibGVfcm9vdDogdHJ1ZQoKdXNlcnM6Ci0gbmFtZToga3ViZXJuZXRlcwogIGdyb3VwczogdXNlcnMsIGFkbWluCiAgbG9ja19wYXNzd2Q6IHRydWUKICBzdWRvOiBBTEw9KEFMTCkgTk9QQVNTV0Q6QUxMCiAgc2hlbGw6IC9iaW4vYmFzaAogIHNzaF9hdXRob3JpemVkX2tleXM6CiAgLSBzc2gtcnNhIEFBQUFCM056YUMxeWMyRUFBQUFEQVFBQkFBQUJnUURkR25KM3g2cThud08reFl4ZFdDb1NubGJKWEJZTUxGYkRTNzFYZnNHSjZqaHFvalRseWNPb0IwQ3psWklLbXpyS3U0Z3ByVmdxQXl1bEVYWE1TUVVJSnNYbi90czZuNXRuVnFnWjlIVEpTRkc4ZUVmam1QTDlpc1YzNGVITDRleHgrTnlpTERYYVVBM2tVZk8xZTV1ZjREcktveHFjdTVnVXlrLzduK0xKeE5neWZ6c1ZsR1RmN3VZUjAvclIvZnZWM2FNL1RFYWwwVmlkTk1nRWFiL1ZQMVcyK1Iwb1ZEMUdRR1oyWHhTV3VWZWh2SmwvTjhoK085VE5rOUdDRTl0SUxaZFl1bkZ3ZTkvb0NSWnF4MkR0YWU3dWRWQ2NjWCtHUTErejBpa3ZqdU0zVTQvRjlOS3BsdzV6SDZtOExvUWZYWkJ5MG9HTVR6czFRQ29UVUlhcG9weWJDTXFydzBMUi9KV0Y2OXB1SS9aSHMvUlRnT2k1akxwM0lwaDUyMjdiZ3hlNmVhaWVGL1BJek0zNnBQdUc0VFRiVVJOREE4cEVDQzZwaURKdFQ3MGlReEcySEVPQkNzVnpTeVJNQldBTWlFWlJtemFRN0lEOW1rZ1kyVjNRTHF6VmZST0gxSzhTSW9zS29WOXlabkFEQVc3WThRRkdmbi8yUzdyL3ppMD0gdGdkYmVmYTNAVUxYR1dQMDA3Cgp3cml0ZV9maWxlczoKLSBwYXRoOiAvZXRjL25ldHBsYW4vNTAtY2xvdWQtaW5pdC55YW1sCiAgb3duZXI6IHJvb3QKICBjb250ZW50OiB8CiAgICBuZXR3b3JrOgogICAgICB2ZXJzaW9uOiAyCiAgICAgIGV0aGVybmV0czoKICAgICAgICBldGgwOgogICAgICAgICAgbWF0Y2g6CiAgICAgICAgICAgIG5hbWU6IGVuKgogICAgICAgICAgYWRkcmVzc2VzOiBbMTAuODAuMC41MC8yNF0KICAgICAgICAgIGdhdGV3YXk0OiAxMC44MC4wLjEKICAgICAgICAgIGRoY3A2OiBmYWxzZQogICAgICAgICAgbmFtZXNlcnZlcnM6CiAgICAgICAgICAgIGFkZHJlc3NlczogWzEuMS4xLjEsIDguOC44LjhdCiAgICAgICAgICBkaGNwNDogZmFsc2UKCnBhY2thZ2VfdXBkYXRlOiB0cnVlCnBhY2thZ2VzOgotIHVuYXR0ZW5kZWQtdXBncmFkZXMKLSBnaXQKLSBqcQotIHZpbQotIG9wZW4taXNjc2kKCnJ1bmNtZDoKLSBuZXRwbGFuIGFwcGx5Ci0gdWZ3IGRpc2FibGUKLSBzeXN0ZW1jdGwgZW5hYmxlIHVuYXR0ZW5kZWQtdXBncmFkZXMKLSBzeXN0ZW1jdGwgZW5hYmxlIGlzY3NpZC5zZXJ2aWNlCi0gc3lzdGVtY3RsIHN0YXJ0IGlzY3NpZC5zZXJ2aWNlCi0gbW91bnQgYnBmZnMgLXQgYnBmIC9zeXMvZnMvYnBmCg==" -> "I2Nsb3VkLWNvbmZpZwoKYm9vdGNtZDoKLSBwcmludGYgIltSZXNvbHZlXVxuRE5TPTguOC44LjgiID4gL2V0Yy9zeXN0ZW1kL3Jlc29sdmVkLmNvbmYKLSBbc3lzdGVtY3RsLCByZXN0YXJ0LCBzeXN0ZW1kLXJlc29sdmVkXQoKcHJlc2VydmVfaG9zdG5hbWU6IGZhbHNlCmhvc3RuYW1lOiBrdWJlcm5ldGVzLWRlbW8tbWFzdGVyLTAKCnNzaF9wd2F1dGg6IGZhbHNlCmRpc2FibGVfcm9vdDogdHJ1ZQoKdXNlcnM6Ci0gbmFtZToga3ViZXJuZXRlcwogIGdyb3VwczogdXNlcnMsIGFkbWluCiAgbG9ja19wYXNzd2Q6IHRydWUKICBzdWRvOiBBTEw9KEFMTCkgTk9QQVNTV0Q6QUxMCiAgc2hlbGw6IC9iaW4vYmFzaAogIHNzaF9hdXRob3JpemVkX2tleXM6CiAgLSBzc2gtcnNhIEFBQUFCM056YUMxeWMyRUFBQUFEQVFBQkFBQUJnUURkR25KM3g2cThud08reFl4ZFdDb1NubGJKWEJZTUxGYkRTNzFYZnNHSjZqaHFvalRseWNPb0IwQ3psWklLbXpyS3U0Z3ByVmdxQXl1bEVYWE1TUVVJSnNYbi90czZuNXRuVnFnWjlIVEpTRkc4ZUVmam1QTDlpc1YzNGVITDRleHgrTnlpTERYYVVBM2tVZk8xZTV1ZjREcktveHFjdTVnVXlrLzduK0xKeE5neWZ6c1ZsR1RmN3VZUjAvclIvZnZWM2FNL1RFYWwwVmlkTk1nRWFiL1ZQMVcyK1Iwb1ZEMUdRR1oyWHhTV3VWZWh2SmwvTjhoK085VE5rOUdDRTl0SUxaZFl1bkZ3ZTkvb0NSWnF4MkR0YWU3dWRWQ2NjWCtHUTErejBpa3ZqdU0zVTQvRjlOS3BsdzV6SDZtOExvUWZYWkJ5MG9HTVR6czFRQ29UVUlhcG9weWJDTXFydzBMUi9KV0Y2OXB1SS9aSHMvUlRnT2k1akxwM0lwaDUyMjdiZ3hlNmVhaWVGL1BJek0zNnBQdUc0VFRiVVJOREE4cEVDQzZwaURKdFQ3MGlReEcySEVPQkNzVnpTeVJNQldBTWlFWlJtemFRN0lEOW1rZ1kyVjNRTHF6VmZST0gxSzhTSW9zS29WOXlabkFEQVc3WThRRkdmbi8yUzdyL3ppMD0gdGdkYmVmYTNAVUxYR1dQMDA3Cgp3cml0ZV9maWxlczoKLSBwYXRoOiAvZXRjL25ldHBsYW4vNTAtY2xvdWQtaW5pdC55YW1sCiAgb3duZXI6IHJvb3QKICBjb250ZW50OiB8CiAgICBuZXR3b3JrOgogICAgICB2ZXJzaW9uOiAyCiAgICAgIGV0aGVybmV0czoKICAgICAgICBldGgwOgogICAgICAgICAgbWF0Y2g6CiAgICAgICAgICAgIG5hbWU6IGVuKgogICAgICAgICAgYWRkcmVzc2VzOiBbMTAuODAuMC41MC8yNF0KICAgICAgICAgIGdhdGV3YXk0OiAxMC44MC4wLjEKICAgICAgICAgIGRoY3A2OiBmYWxzZQogICAgICAgICAgbmFtZXNlcnZlcnM6CiAgICAgICAgICAgIGFkZHJlc3NlczogWzEuMS4xLjEsIDguOC44LjhdCiAgICAgICAgICBkaGNwNDogZmFsc2UKLSBwYXRoOiAvZXRjL3N5c2N0bC5kLzc3LWt1YmVybmV0ZXMuY29uZgogIG93bmVyOiByb290CiAgY29udGVudDogfAogICAgbmV0LmlwdjQuaXBfZm9yd2FyZD0xCiAgICBmcy5pbm90aWZ5Lm1heF91c2VyX3dhdGNoZXM9NjU1MzYKICAgIGZzLmlub3RpZnkubWF4X3VzZXJfaW5zdGFuY2VzPTgxOTIKLSBwYXRoOiAvZXRjL2xvZ3JvdGF0ZS5kL3JzeXNsb2cKICBvd25lcjogcm9vdAogIGNvbnRlbnQ6IHwKICAgIC92YXIvbG9nL3N5c2xvZwogICAgL3Zhci9sb2cvbWFpbC5pbmZvCiAgICAvdmFyL2xvZy9tYWlsLndhcm4KICAgIC92YXIvbG9nL21haWwuZXJyCiAgICAvdmFyL2xvZy9tYWlsLmxvZwogICAgL3Zhci9sb2cvZGFlbW9uLmxvZwogICAgL3Zhci9sb2cva2Vybi5sb2cKICAgIC92YXIvbG9nL2F1dGgubG9nCiAgICAvdmFyL2xvZy91c2VyLmxvZwogICAgL3Zhci9sb2cvbHByLmxvZwogICAgL3Zhci9sb2cvY3Jvbi5sb2cKICAgIC92YXIvbG9nL2RlYnVnCiAgICAvdmFyL2xvZy9tZXNzYWdlcwogICAgewogICAgICByb3RhdGUgNwogICAgICBkYWlseQogICAgICBtaXNzaW5nb2sKICAgICAgbm90aWZlbXB0eQogICAgICBjb21wcmVzcwogICAgICBzaGFyZWRzY3JpcHRzCiAgICAgIHBvc3Ryb3RhdGUKICAgICAgICAvdXNyL2xpYi9yc3lzbG9nL3JzeXNsb2ctcm90YXRlCiAgICAgIGVuZHNjcmlwdAogICAgfQoKcGFja2FnZV91cGRhdGU6IHRydWUKcGFja2FnZXM6Ci0gdW5hdHRlbmRlZC11cGdyYWRlcwotIGdpdAotIGpxCi0gdmltCi0gb3Blbi1pc2NzaQoKcnVuY21kOgotIG5ldHBsYW4gYXBwbHkKLSB1ZncgZGlzYWJsZQotIHN5c3RlbWN0bCBlbmFibGUgdW5hdHRlbmRlZC11cGdyYWRlcwotIHN5c3RlbWN0bCBlbmFibGUgaXNjc2lkLnNlcnZpY2UKLSBzeXN0ZW1jdGwgc3RhcnQgaXNjc2lkLnNlcnZpY2UKLSBtb3VudCBicGZmcyAtdCBicGYgL3N5cy9mcy9icGYK"
            # (2 unchanged elements hidden)
        }
        id                             = "urn:vcloud:vm:58dbc3ee-c415-4914-89a4-713b2a2a2701"
        name                           = "kubernetes-demo-master-0"
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.infrastructure.vcd_vapp_vm.k8s_control_plane[1] will be updated in-place
  ~ resource "vcd_vapp_vm" "k8s_control_plane" {
      ~ guest_properties               = {
          ~ "user-data"      = "I2Nsb3VkLWNvbmZpZwoKYm9vdGNtZDoKLSBwcmludGYgIltSZXNvbHZlXVxuRE5TPTguOC44LjgiID4gL2V0Yy9zeXN0ZW1kL3Jlc29sdmVkLmNvbmYKLSBbc3lzdGVtY3RsLCByZXN0YXJ0LCBzeXN0ZW1kLXJlc29sdmVkXQoKcHJlc2VydmVfaG9zdG5hbWU6IGZhbHNlCmhvc3RuYW1lOiBrdWJlcm5ldGVzLWRlbW8tbWFzdGVyLTEKCnNzaF9wd2F1dGg6IGZhbHNlCmRpc2FibGVfcm9vdDogdHJ1ZQoKdXNlcnM6Ci0gbmFtZToga3ViZXJuZXRlcwogIGdyb3VwczogdXNlcnMsIGFkbWluCiAgbG9ja19wYXNzd2Q6IHRydWUKICBzdWRvOiBBTEw9KEFMTCkgTk9QQVNTV0Q6QUxMCiAgc2hlbGw6IC9iaW4vYmFzaAogIHNzaF9hdXRob3JpemVkX2tleXM6CiAgLSBzc2gtcnNhIEFBQUFCM056YUMxeWMyRUFBQUFEQVFBQkFBQUJnUURkR25KM3g2cThud08reFl4ZFdDb1NubGJKWEJZTUxGYkRTNzFYZnNHSjZqaHFvalRseWNPb0IwQ3psWklLbXpyS3U0Z3ByVmdxQXl1bEVYWE1TUVVJSnNYbi90czZuNXRuVnFnWjlIVEpTRkc4ZUVmam1QTDlpc1YzNGVITDRleHgrTnlpTERYYVVBM2tVZk8xZTV1ZjREcktveHFjdTVnVXlrLzduK0xKeE5neWZ6c1ZsR1RmN3VZUjAvclIvZnZWM2FNL1RFYWwwVmlkTk1nRWFiL1ZQMVcyK1Iwb1ZEMUdRR1oyWHhTV3VWZWh2SmwvTjhoK085VE5rOUdDRTl0SUxaZFl1bkZ3ZTkvb0NSWnF4MkR0YWU3dWRWQ2NjWCtHUTErejBpa3ZqdU0zVTQvRjlOS3BsdzV6SDZtOExvUWZYWkJ5MG9HTVR6czFRQ29UVUlhcG9weWJDTXFydzBMUi9KV0Y2OXB1SS9aSHMvUlRnT2k1akxwM0lwaDUyMjdiZ3hlNmVhaWVGL1BJek0zNnBQdUc0VFRiVVJOREE4cEVDQzZwaURKdFQ3MGlReEcySEVPQkNzVnpTeVJNQldBTWlFWlJtemFRN0lEOW1rZ1kyVjNRTHF6VmZST0gxSzhTSW9zS29WOXlabkFEQVc3WThRRkdmbi8yUzdyL3ppMD0gdGdkYmVmYTNAVUxYR1dQMDA3Cgp3cml0ZV9maWxlczoKLSBwYXRoOiAvZXRjL25ldHBsYW4vNTAtY2xvdWQtaW5pdC55YW1sCiAgb3duZXI6IHJvb3QKICBjb250ZW50OiB8CiAgICBuZXR3b3JrOgogICAgICB2ZXJzaW9uOiAyCiAgICAgIGV0aGVybmV0czoKICAgICAgICBldGgwOgogICAgICAgICAgbWF0Y2g6CiAgICAgICAgICAgIG5hbWU6IGVuKgogICAgICAgICAgYWRkcmVzc2VzOiBbMTAuODAuMC41MS8yNF0KICAgICAgICAgIGdhdGV3YXk0OiAxMC44MC4wLjEKICAgICAgICAgIGRoY3A2OiBmYWxzZQogICAgICAgICAgbmFtZXNlcnZlcnM6CiAgICAgICAgICAgIGFkZHJlc3NlczogWzEuMS4xLjEsIDguOC44LjhdCiAgICAgICAgICBkaGNwNDogZmFsc2UKCnBhY2thZ2VfdXBkYXRlOiB0cnVlCnBhY2thZ2VzOgotIHVuYXR0ZW5kZWQtdXBncmFkZXMKLSBnaXQKLSBqcQotIHZpbQotIG9wZW4taXNjc2kKCnJ1bmNtZDoKLSBuZXRwbGFuIGFwcGx5Ci0gdWZ3IGRpc2FibGUKLSBzeXN0ZW1jdGwgZW5hYmxlIHVuYXR0ZW5kZWQtdXBncmFkZXMKLSBzeXN0ZW1jdGwgZW5hYmxlIGlzY3NpZC5zZXJ2aWNlCi0gc3lzdGVtY3RsIHN0YXJ0IGlzY3NpZC5zZXJ2aWNlCi0gbW91bnQgYnBmZnMgLXQgYnBmIC9zeXMvZnMvYnBmCg==" -> "I2Nsb3VkLWNvbmZpZwoKYm9vdGNtZDoKLSBwcmludGYgIltSZXNvbHZlXVxuRE5TPTguOC44LjgiID4gL2V0Yy9zeXN0ZW1kL3Jlc29sdmVkLmNvbmYKLSBbc3lzdGVtY3RsLCByZXN0YXJ0LCBzeXN0ZW1kLXJlc29sdmVkXQoKcHJlc2VydmVfaG9zdG5hbWU6IGZhbHNlCmhvc3RuYW1lOiBrdWJlcm5ldGVzLWRlbW8tbWFzdGVyLTEKCnNzaF9wd2F1dGg6IGZhbHNlCmRpc2FibGVfcm9vdDogdHJ1ZQoKdXNlcnM6Ci0gbmFtZToga3ViZXJuZXRlcwogIGdyb3VwczogdXNlcnMsIGFkbWluCiAgbG9ja19wYXNzd2Q6IHRydWUKICBzdWRvOiBBTEw9KEFMTCkgTk9QQVNTV0Q6QUxMCiAgc2hlbGw6IC9iaW4vYmFzaAogIHNzaF9hdXRob3JpemVkX2tleXM6CiAgLSBzc2gtcnNhIEFBQUFCM056YUMxeWMyRUFBQUFEQVFBQkFBQUJnUURkR25KM3g2cThud08reFl4ZFdDb1NubGJKWEJZTUxGYkRTNzFYZnNHSjZqaHFvalRseWNPb0IwQ3psWklLbXpyS3U0Z3ByVmdxQXl1bEVYWE1TUVVJSnNYbi90czZuNXRuVnFnWjlIVEpTRkc4ZUVmam1QTDlpc1YzNGVITDRleHgrTnlpTERYYVVBM2tVZk8xZTV1ZjREcktveHFjdTVnVXlrLzduK0xKeE5neWZ6c1ZsR1RmN3VZUjAvclIvZnZWM2FNL1RFYWwwVmlkTk1nRWFiL1ZQMVcyK1Iwb1ZEMUdRR1oyWHhTV3VWZWh2SmwvTjhoK085VE5rOUdDRTl0SUxaZFl1bkZ3ZTkvb0NSWnF4MkR0YWU3dWRWQ2NjWCtHUTErejBpa3ZqdU0zVTQvRjlOS3BsdzV6SDZtOExvUWZYWkJ5MG9HTVR6czFRQ29UVUlhcG9weWJDTXFydzBMUi9KV0Y2OXB1SS9aSHMvUlRnT2k1akxwM0lwaDUyMjdiZ3hlNmVhaWVGL1BJek0zNnBQdUc0VFRiVVJOREE4cEVDQzZwaURKdFQ3MGlReEcySEVPQkNzVnpTeVJNQldBTWlFWlJtemFRN0lEOW1rZ1kyVjNRTHF6VmZST0gxSzhTSW9zS29WOXlabkFEQVc3WThRRkdmbi8yUzdyL3ppMD0gdGdkYmVmYTNAVUxYR1dQMDA3Cgp3cml0ZV9maWxlczoKLSBwYXRoOiAvZXRjL25ldHBsYW4vNTAtY2xvdWQtaW5pdC55YW1sCiAgb3duZXI6IHJvb3QKICBjb250ZW50OiB8CiAgICBuZXR3b3JrOgogICAgICB2ZXJzaW9uOiAyCiAgICAgIGV0aGVybmV0czoKICAgICAgICBldGgwOgogICAgICAgICAgbWF0Y2g6CiAgICAgICAgICAgIG5hbWU6IGVuKgogICAgICAgICAgYWRkcmVzc2VzOiBbMTAuODAuMC41MS8yNF0KICAgICAgICAgIGdhdGV3YXk0OiAxMC44MC4wLjEKICAgICAgICAgIGRoY3A2OiBmYWxzZQogICAgICAgICAgbmFtZXNlcnZlcnM6CiAgICAgICAgICAgIGFkZHJlc3NlczogWzEuMS4xLjEsIDguOC44LjhdCiAgICAgICAgICBkaGNwNDogZmFsc2UKLSBwYXRoOiAvZXRjL3N5c2N0bC5kLzc3LWt1YmVybmV0ZXMuY29uZgogIG93bmVyOiByb290CiAgY29udGVudDogfAogICAgbmV0LmlwdjQuaXBfZm9yd2FyZD0xCiAgICBmcy5pbm90aWZ5Lm1heF91c2VyX3dhdGNoZXM9NjU1MzYKICAgIGZzLmlub3RpZnkubWF4X3VzZXJfaW5zdGFuY2VzPTgxOTIKLSBwYXRoOiAvZXRjL2xvZ3JvdGF0ZS5kL3JzeXNsb2cKICBvd25lcjogcm9vdAogIGNvbnRlbnQ6IHwKICAgIC92YXIvbG9nL3N5c2xvZwogICAgL3Zhci9sb2cvbWFpbC5pbmZvCiAgICAvdmFyL2xvZy9tYWlsLndhcm4KICAgIC92YXIvbG9nL21haWwuZXJyCiAgICAvdmFyL2xvZy9tYWlsLmxvZwogICAgL3Zhci9sb2cvZGFlbW9uLmxvZwogICAgL3Zhci9sb2cva2Vybi5sb2cKICAgIC92YXIvbG9nL2F1dGgubG9nCiAgICAvdmFyL2xvZy91c2VyLmxvZwogICAgL3Zhci9sb2cvbHByLmxvZwogICAgL3Zhci9sb2cvY3Jvbi5sb2cKICAgIC92YXIvbG9nL2RlYnVnCiAgICAvdmFyL2xvZy9tZXNzYWdlcwogICAgewogICAgICByb3RhdGUgNwogICAgICBkYWlseQogICAgICBtaXNzaW5nb2sKICAgICAgbm90aWZlbXB0eQogICAgICBjb21wcmVzcwogICAgICBzaGFyZWRzY3JpcHRzCiAgICAgIHBvc3Ryb3RhdGUKICAgICAgICAvdXNyL2xpYi9yc3lzbG9nL3JzeXNsb2ctcm90YXRlCiAgICAgIGVuZHNjcmlwdAogICAgfQoKcGFja2FnZV91cGRhdGU6IHRydWUKcGFja2FnZXM6Ci0gdW5hdHRlbmRlZC11cGdyYWRlcwotIGdpdAotIGpxCi0gdmltCi0gb3Blbi1pc2NzaQoKcnVuY21kOgotIG5ldHBsYW4gYXBwbHkKLSB1ZncgZGlzYWJsZQotIHN5c3RlbWN0bCBlbmFibGUgdW5hdHRlbmRlZC11cGdyYWRlcwotIHN5c3RlbWN0bCBlbmFibGUgaXNjc2lkLnNlcnZpY2UKLSBzeXN0ZW1jdGwgc3RhcnQgaXNjc2lkLnNlcnZpY2UKLSBtb3VudCBicGZmcyAtdCBicGYgL3N5cy9mcy9icGYK"
            # (2 unchanged elements hidden)
        }
        id                             = "urn:vcloud:vm:12c70c38-e7c0-4a2f-a1d8-df9cdeba588d"
        name                           = "kubernetes-demo-master-1"
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.infrastructure.vcd_vapp_vm.k8s_control_plane[2] will be updated in-place
  ~ resource "vcd_vapp_vm" "k8s_control_plane" {
      ~ guest_properties               = {
          ~ "user-data"      = "I2Nsb3VkLWNvbmZpZwoKYm9vdGNtZDoKLSBwcmludGYgIltSZXNvbHZlXVxuRE5TPTguOC44LjgiID4gL2V0Yy9zeXN0ZW1kL3Jlc29sdmVkLmNvbmYKLSBbc3lzdGVtY3RsLCByZXN0YXJ0LCBzeXN0ZW1kLXJlc29sdmVkXQoKcHJlc2VydmVfaG9zdG5hbWU6IGZhbHNlCmhvc3RuYW1lOiBrdWJlcm5ldGVzLWRlbW8tbWFzdGVyLTIKCnNzaF9wd2F1dGg6IGZhbHNlCmRpc2FibGVfcm9vdDogdHJ1ZQoKdXNlcnM6Ci0gbmFtZToga3ViZXJuZXRlcwogIGdyb3VwczogdXNlcnMsIGFkbWluCiAgbG9ja19wYXNzd2Q6IHRydWUKICBzdWRvOiBBTEw9KEFMTCkgTk9QQVNTV0Q6QUxMCiAgc2hlbGw6IC9iaW4vYmFzaAogIHNzaF9hdXRob3JpemVkX2tleXM6CiAgLSBzc2gtcnNhIEFBQUFCM056YUMxeWMyRUFBQUFEQVFBQkFBQUJnUURkR25KM3g2cThud08reFl4ZFdDb1NubGJKWEJZTUxGYkRTNzFYZnNHSjZqaHFvalRseWNPb0IwQ3psWklLbXpyS3U0Z3ByVmdxQXl1bEVYWE1TUVVJSnNYbi90czZuNXRuVnFnWjlIVEpTRkc4ZUVmam1QTDlpc1YzNGVITDRleHgrTnlpTERYYVVBM2tVZk8xZTV1ZjREcktveHFjdTVnVXlrLzduK0xKeE5neWZ6c1ZsR1RmN3VZUjAvclIvZnZWM2FNL1RFYWwwVmlkTk1nRWFiL1ZQMVcyK1Iwb1ZEMUdRR1oyWHhTV3VWZWh2SmwvTjhoK085VE5rOUdDRTl0SUxaZFl1bkZ3ZTkvb0NSWnF4MkR0YWU3dWRWQ2NjWCtHUTErejBpa3ZqdU0zVTQvRjlOS3BsdzV6SDZtOExvUWZYWkJ5MG9HTVR6czFRQ29UVUlhcG9weWJDTXFydzBMUi9KV0Y2OXB1SS9aSHMvUlRnT2k1akxwM0lwaDUyMjdiZ3hlNmVhaWVGL1BJek0zNnBQdUc0VFRiVVJOREE4cEVDQzZwaURKdFQ3MGlReEcySEVPQkNzVnpTeVJNQldBTWlFWlJtemFRN0lEOW1rZ1kyVjNRTHF6VmZST0gxSzhTSW9zS29WOXlabkFEQVc3WThRRkdmbi8yUzdyL3ppMD0gdGdkYmVmYTNAVUxYR1dQMDA3Cgp3cml0ZV9maWxlczoKLSBwYXRoOiAvZXRjL25ldHBsYW4vNTAtY2xvdWQtaW5pdC55YW1sCiAgb3duZXI6IHJvb3QKICBjb250ZW50OiB8CiAgICBuZXR3b3JrOgogICAgICB2ZXJzaW9uOiAyCiAgICAgIGV0aGVybmV0czoKICAgICAgICBldGgwOgogICAgICAgICAgbWF0Y2g6CiAgICAgICAgICAgIG5hbWU6IGVuKgogICAgICAgICAgYWRkcmVzc2VzOiBbMTAuODAuMC41Mi8yNF0KICAgICAgICAgIGdhdGV3YXk0OiAxMC44MC4wLjEKICAgICAgICAgIGRoY3A2OiBmYWxzZQogICAgICAgICAgbmFtZXNlcnZlcnM6CiAgICAgICAgICAgIGFkZHJlc3NlczogWzEuMS4xLjEsIDguOC44LjhdCiAgICAgICAgICBkaGNwNDogZmFsc2UKCnBhY2thZ2VfdXBkYXRlOiB0cnVlCnBhY2thZ2VzOgotIHVuYXR0ZW5kZWQtdXBncmFkZXMKLSBnaXQKLSBqcQotIHZpbQotIG9wZW4taXNjc2kKCnJ1bmNtZDoKLSBuZXRwbGFuIGFwcGx5Ci0gdWZ3IGRpc2FibGUKLSBzeXN0ZW1jdGwgZW5hYmxlIHVuYXR0ZW5kZWQtdXBncmFkZXMKLSBzeXN0ZW1jdGwgZW5hYmxlIGlzY3NpZC5zZXJ2aWNlCi0gc3lzdGVtY3RsIHN0YXJ0IGlzY3NpZC5zZXJ2aWNlCi0gbW91bnQgYnBmZnMgLXQgYnBmIC9zeXMvZnMvYnBmCg==" -> "I2Nsb3VkLWNvbmZpZwoKYm9vdGNtZDoKLSBwcmludGYgIltSZXNvbHZlXVxuRE5TPTguOC44LjgiID4gL2V0Yy9zeXN0ZW1kL3Jlc29sdmVkLmNvbmYKLSBbc3lzdGVtY3RsLCByZXN0YXJ0LCBzeXN0ZW1kLXJlc29sdmVkXQoKcHJlc2VydmVfaG9zdG5hbWU6IGZhbHNlCmhvc3RuYW1lOiBrdWJlcm5ldGVzLWRlbW8tbWFzdGVyLTIKCnNzaF9wd2F1dGg6IGZhbHNlCmRpc2FibGVfcm9vdDogdHJ1ZQoKdXNlcnM6Ci0gbmFtZToga3ViZXJuZXRlcwogIGdyb3VwczogdXNlcnMsIGFkbWluCiAgbG9ja19wYXNzd2Q6IHRydWUKICBzdWRvOiBBTEw9KEFMTCkgTk9QQVNTV0Q6QUxMCiAgc2hlbGw6IC9iaW4vYmFzaAogIHNzaF9hdXRob3JpemVkX2tleXM6CiAgLSBzc2gtcnNhIEFBQUFCM056YUMxeWMyRUFBQUFEQVFBQkFBQUJnUURkR25KM3g2cThud08reFl4ZFdDb1NubGJKWEJZTUxGYkRTNzFYZnNHSjZqaHFvalRseWNPb0IwQ3psWklLbXpyS3U0Z3ByVmdxQXl1bEVYWE1TUVVJSnNYbi90czZuNXRuVnFnWjlIVEpTRkc4ZUVmam1QTDlpc1YzNGVITDRleHgrTnlpTERYYVVBM2tVZk8xZTV1ZjREcktveHFjdTVnVXlrLzduK0xKeE5neWZ6c1ZsR1RmN3VZUjAvclIvZnZWM2FNL1RFYWwwVmlkTk1nRWFiL1ZQMVcyK1Iwb1ZEMUdRR1oyWHhTV3VWZWh2SmwvTjhoK085VE5rOUdDRTl0SUxaZFl1bkZ3ZTkvb0NSWnF4MkR0YWU3dWRWQ2NjWCtHUTErejBpa3ZqdU0zVTQvRjlOS3BsdzV6SDZtOExvUWZYWkJ5MG9HTVR6czFRQ29UVUlhcG9weWJDTXFydzBMUi9KV0Y2OXB1SS9aSHMvUlRnT2k1akxwM0lwaDUyMjdiZ3hlNmVhaWVGL1BJek0zNnBQdUc0VFRiVVJOREE4cEVDQzZwaURKdFQ3MGlReEcySEVPQkNzVnpTeVJNQldBTWlFWlJtemFRN0lEOW1rZ1kyVjNRTHF6VmZST0gxSzhTSW9zS29WOXlabkFEQVc3WThRRkdmbi8yUzdyL3ppMD0gdGdkYmVmYTNAVUxYR1dQMDA3Cgp3cml0ZV9maWxlczoKLSBwYXRoOiAvZXRjL25ldHBsYW4vNTAtY2xvdWQtaW5pdC55YW1sCiAgb3duZXI6IHJvb3QKICBjb250ZW50OiB8CiAgICBuZXR3b3JrOgogICAgICB2ZXJzaW9uOiAyCiAgICAgIGV0aGVybmV0czoKICAgICAgICBldGgwOgogICAgICAgICAgbWF0Y2g6CiAgICAgICAgICAgIG5hbWU6IGVuKgogICAgICAgICAgYWRkcmVzc2VzOiBbMTAuODAuMC41Mi8yNF0KICAgICAgICAgIGdhdGV3YXk0OiAxMC44MC4wLjEKICAgICAgICAgIGRoY3A2OiBmYWxzZQogICAgICAgICAgbmFtZXNlcnZlcnM6CiAgICAgICAgICAgIGFkZHJlc3NlczogWzEuMS4xLjEsIDguOC44LjhdCiAgICAgICAgICBkaGNwNDogZmFsc2UKLSBwYXRoOiAvZXRjL3N5c2N0bC5kLzc3LWt1YmVybmV0ZXMuY29uZgogIG93bmVyOiByb290CiAgY29udGVudDogfAogICAgbmV0LmlwdjQuaXBfZm9yd2FyZD0xCiAgICBmcy5pbm90aWZ5Lm1heF91c2VyX3dhdGNoZXM9NjU1MzYKICAgIGZzLmlub3RpZnkubWF4X3VzZXJfaW5zdGFuY2VzPTgxOTIKLSBwYXRoOiAvZXRjL2xvZ3JvdGF0ZS5kL3JzeXNsb2cKICBvd25lcjogcm9vdAogIGNvbnRlbnQ6IHwKICAgIC92YXIvbG9nL3N5c2xvZwogICAgL3Zhci9sb2cvbWFpbC5pbmZvCiAgICAvdmFyL2xvZy9tYWlsLndhcm4KICAgIC92YXIvbG9nL21haWwuZXJyCiAgICAvdmFyL2xvZy9tYWlsLmxvZwogICAgL3Zhci9sb2cvZGFlbW9uLmxvZwogICAgL3Zhci9sb2cva2Vybi5sb2cKICAgIC92YXIvbG9nL2F1dGgubG9nCiAgICAvdmFyL2xvZy91c2VyLmxvZwogICAgL3Zhci9sb2cvbHByLmxvZwogICAgL3Zhci9sb2cvY3Jvbi5sb2cKICAgIC92YXIvbG9nL2RlYnVnCiAgICAvdmFyL2xvZy9tZXNzYWdlcwogICAgewogICAgICByb3RhdGUgNwogICAgICBkYWlseQogICAgICBtaXNzaW5nb2sKICAgICAgbm90aWZlbXB0eQogICAgICBjb21wcmVzcwogICAgICBzaGFyZWRzY3JpcHRzCiAgICAgIHBvc3Ryb3RhdGUKICAgICAgICAvdXNyL2xpYi9yc3lzbG9nL3JzeXNsb2ctcm90YXRlCiAgICAgIGVuZHNjcmlwdAogICAgfQoKcGFja2FnZV91cGRhdGU6IHRydWUKcGFja2FnZXM6Ci0gdW5hdHRlbmRlZC11cGdyYWRlcwotIGdpdAotIGpxCi0gdmltCi0gb3Blbi1pc2NzaQoKcnVuY21kOgotIG5ldHBsYW4gYXBwbHkKLSB1ZncgZGlzYWJsZQotIHN5c3RlbWN0bCBlbmFibGUgdW5hdHRlbmRlZC11cGdyYWRlcwotIHN5c3RlbWN0bCBlbmFibGUgaXNjc2lkLnNlcnZpY2UKLSBzeXN0ZW1jdGwgc3RhcnQgaXNjc2lkLnNlcnZpY2UKLSBtb3VudCBicGZmcyAtdCBicGYgL3N5cy9mcy9icGYK"
            # (2 unchanged elements hidden)
        }
        id                             = "urn:vcloud:vm:faa73b4c-c212-4a03-bcfd-899709a1ab9d"
        name                           = "kubernetes-demo-master-2"
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.infrastructure.vcd_vapp_vm.k8s_worker[0] will be updated in-place
  ~ resource "vcd_vapp_vm" "k8s_worker" {
      ~ guest_properties               = {
          ~ "user-data"      = "I2Nsb3VkLWNvbmZpZwoKYm9vdGNtZDoKLSBwcmludGYgIltSZXNvbHZlXVxuRE5TPTguOC44LjgiID4gL2V0Yy9zeXN0ZW1kL3Jlc29sdmVkLmNvbmYKLSBbc3lzdGVtY3RsLCByZXN0YXJ0LCBzeXN0ZW1kLXJlc29sdmVkXQoKcHJlc2VydmVfaG9zdG5hbWU6IGZhbHNlCmhvc3RuYW1lOiBrdWJlcm5ldGVzLWRlbW8td29ya2VyLTAKCnNzaF9wd2F1dGg6IGZhbHNlCmRpc2FibGVfcm9vdDogdHJ1ZQoKdXNlcnM6Ci0gbmFtZToga3ViZXJuZXRlcwogIGdyb3VwczogdXNlcnMsIGFkbWluCiAgbG9ja19wYXNzd2Q6IHRydWUKICBzdWRvOiBBTEw9KEFMTCkgTk9QQVNTV0Q6QUxMCiAgc2hlbGw6IC9iaW4vYmFzaAogIHNzaF9hdXRob3JpemVkX2tleXM6CiAgLSBzc2gtcnNhIEFBQUFCM056YUMxeWMyRUFBQUFEQVFBQkFBQUJnUURkR25KM3g2cThud08reFl4ZFdDb1NubGJKWEJZTUxGYkRTNzFYZnNHSjZqaHFvalRseWNPb0IwQ3psWklLbXpyS3U0Z3ByVmdxQXl1bEVYWE1TUVVJSnNYbi90czZuNXRuVnFnWjlIVEpTRkc4ZUVmam1QTDlpc1YzNGVITDRleHgrTnlpTERYYVVBM2tVZk8xZTV1ZjREcktveHFjdTVnVXlrLzduK0xKeE5neWZ6c1ZsR1RmN3VZUjAvclIvZnZWM2FNL1RFYWwwVmlkTk1nRWFiL1ZQMVcyK1Iwb1ZEMUdRR1oyWHhTV3VWZWh2SmwvTjhoK085VE5rOUdDRTl0SUxaZFl1bkZ3ZTkvb0NSWnF4MkR0YWU3dWRWQ2NjWCtHUTErejBpa3ZqdU0zVTQvRjlOS3BsdzV6SDZtOExvUWZYWkJ5MG9HTVR6czFRQ29UVUlhcG9weWJDTXFydzBMUi9KV0Y2OXB1SS9aSHMvUlRnT2k1akxwM0lwaDUyMjdiZ3hlNmVhaWVGL1BJek0zNnBQdUc0VFRiVVJOREE4cEVDQzZwaURKdFQ3MGlReEcySEVPQkNzVnpTeVJNQldBTWlFWlJtemFRN0lEOW1rZ1kyVjNRTHF6VmZST0gxSzhTSW9zS29WOXlabkFEQVc3WThRRkdmbi8yUzdyL3ppMD0gdGdkYmVmYTNAVUxYR1dQMDA3Cgp3cml0ZV9maWxlczoKLSBwYXRoOiAvZXRjL25ldHBsYW4vNTAtY2xvdWQtaW5pdC55YW1sCiAgb3duZXI6IHJvb3QKICBjb250ZW50OiB8CiAgICBuZXR3b3JrOgogICAgICB2ZXJzaW9uOiAyCiAgICAgIGV0aGVybmV0czoKICAgICAgICBldGgwOgogICAgICAgICAgbWF0Y2g6CiAgICAgICAgICAgIG5hbWU6IGVuKgogICAgICAgICAgYWRkcmVzc2VzOiBbMTAuODAuMC4xMDAvMjRdCiAgICAgICAgICBnYXRld2F5NDogMTAuODAuMC4xCiAgICAgICAgICBkaGNwNjogZmFsc2UKICAgICAgICAgIG5hbWVzZXJ2ZXJzOgogICAgICAgICAgICBhZGRyZXNzZXM6IFsxLjEuMS4xLCA4LjguOC44XQogICAgICAgICAgZGhjcDQ6IGZhbHNlCgpwYWNrYWdlX3VwZGF0ZTogdHJ1ZQpwYWNrYWdlczoKLSB1bmF0dGVuZGVkLXVwZ3JhZGVzCi0gZ2l0Ci0ganEKLSB2aW0KLSBvcGVuLWlzY3NpCgpydW5jbWQ6Ci0gbmV0cGxhbiBhcHBseQotIHVmdyBkaXNhYmxlCi0gc3lzdGVtY3RsIGVuYWJsZSB1bmF0dGVuZGVkLXVwZ3JhZGVzCi0gc3lzdGVtY3RsIGVuYWJsZSBpc2NzaWQuc2VydmljZQotIHN5c3RlbWN0bCBzdGFydCBpc2NzaWQuc2VydmljZQotIG1vdW50IGJwZmZzIC10IGJwZiAvc3lzL2ZzL2JwZgo=" -> "I2Nsb3VkLWNvbmZpZwoKYm9vdGNtZDoKLSBwcmludGYgIltSZXNvbHZlXVxuRE5TPTguOC44LjgiID4gL2V0Yy9zeXN0ZW1kL3Jlc29sdmVkLmNvbmYKLSBbc3lzdGVtY3RsLCByZXN0YXJ0LCBzeXN0ZW1kLXJlc29sdmVkXQoKcHJlc2VydmVfaG9zdG5hbWU6IGZhbHNlCmhvc3RuYW1lOiBrdWJlcm5ldGVzLWRlbW8td29ya2VyLTAKCnNzaF9wd2F1dGg6IGZhbHNlCmRpc2FibGVfcm9vdDogdHJ1ZQoKdXNlcnM6Ci0gbmFtZToga3ViZXJuZXRlcwogIGdyb3VwczogdXNlcnMsIGFkbWluCiAgbG9ja19wYXNzd2Q6IHRydWUKICBzdWRvOiBBTEw9KEFMTCkgTk9QQVNTV0Q6QUxMCiAgc2hlbGw6IC9iaW4vYmFzaAogIHNzaF9hdXRob3JpemVkX2tleXM6CiAgLSBzc2gtcnNhIEFBQUFCM056YUMxeWMyRUFBQUFEQVFBQkFBQUJnUURkR25KM3g2cThud08reFl4ZFdDb1NubGJKWEJZTUxGYkRTNzFYZnNHSjZqaHFvalRseWNPb0IwQ3psWklLbXpyS3U0Z3ByVmdxQXl1bEVYWE1TUVVJSnNYbi90czZuNXRuVnFnWjlIVEpTRkc4ZUVmam1QTDlpc1YzNGVITDRleHgrTnlpTERYYVVBM2tVZk8xZTV1ZjREcktveHFjdTVnVXlrLzduK0xKeE5neWZ6c1ZsR1RmN3VZUjAvclIvZnZWM2FNL1RFYWwwVmlkTk1nRWFiL1ZQMVcyK1Iwb1ZEMUdRR1oyWHhTV3VWZWh2SmwvTjhoK085VE5rOUdDRTl0SUxaZFl1bkZ3ZTkvb0NSWnF4MkR0YWU3dWRWQ2NjWCtHUTErejBpa3ZqdU0zVTQvRjlOS3BsdzV6SDZtOExvUWZYWkJ5MG9HTVR6czFRQ29UVUlhcG9weWJDTXFydzBMUi9KV0Y2OXB1SS9aSHMvUlRnT2k1akxwM0lwaDUyMjdiZ3hlNmVhaWVGL1BJek0zNnBQdUc0VFRiVVJOREE4cEVDQzZwaURKdFQ3MGlReEcySEVPQkNzVnpTeVJNQldBTWlFWlJtemFRN0lEOW1rZ1kyVjNRTHF6VmZST0gxSzhTSW9zS29WOXlabkFEQVc3WThRRkdmbi8yUzdyL3ppMD0gdGdkYmVmYTNAVUxYR1dQMDA3Cgp3cml0ZV9maWxlczoKLSBwYXRoOiAvZXRjL25ldHBsYW4vNTAtY2xvdWQtaW5pdC55YW1sCiAgb3duZXI6IHJvb3QKICBjb250ZW50OiB8CiAgICBuZXR3b3JrOgogICAgICB2ZXJzaW9uOiAyCiAgICAgIGV0aGVybmV0czoKICAgICAgICBldGgwOgogICAgICAgICAgbWF0Y2g6CiAgICAgICAgICAgIG5hbWU6IGVuKgogICAgICAgICAgYWRkcmVzc2VzOiBbMTAuODAuMC4xMDAvMjRdCiAgICAgICAgICBnYXRld2F5NDogMTAuODAuMC4xCiAgICAgICAgICBkaGNwNjogZmFsc2UKICAgICAgICAgIG5hbWVzZXJ2ZXJzOgogICAgICAgICAgICBhZGRyZXNzZXM6IFsxLjEuMS4xLCA4LjguOC44XQogICAgICAgICAgZGhjcDQ6IGZhbHNlCi0gcGF0aDogL2V0Yy9zeXNjdGwuZC83Ny1rdWJlcm5ldGVzLmNvbmYKICBvd25lcjogcm9vdAogIGNvbnRlbnQ6IHwKICAgIG5ldC5pcHY0LmlwX2ZvcndhcmQ9MQogICAgZnMuaW5vdGlmeS5tYXhfdXNlcl93YXRjaGVzPTY1NTM2CiAgICBmcy5pbm90aWZ5Lm1heF91c2VyX2luc3RhbmNlcz04MTkyCi0gcGF0aDogL2V0Yy9sb2dyb3RhdGUuZC9yc3lzbG9nCiAgb3duZXI6IHJvb3QKICBjb250ZW50OiB8CiAgICAvdmFyL2xvZy9zeXNsb2cKICAgIC92YXIvbG9nL21haWwuaW5mbwogICAgL3Zhci9sb2cvbWFpbC53YXJuCiAgICAvdmFyL2xvZy9tYWlsLmVycgogICAgL3Zhci9sb2cvbWFpbC5sb2cKICAgIC92YXIvbG9nL2RhZW1vbi5sb2cKICAgIC92YXIvbG9nL2tlcm4ubG9nCiAgICAvdmFyL2xvZy9hdXRoLmxvZwogICAgL3Zhci9sb2cvdXNlci5sb2cKICAgIC92YXIvbG9nL2xwci5sb2cKICAgIC92YXIvbG9nL2Nyb24ubG9nCiAgICAvdmFyL2xvZy9kZWJ1ZwogICAgL3Zhci9sb2cvbWVzc2FnZXMKICAgIHsKICAgICAgcm90YXRlIDcKICAgICAgZGFpbHkKICAgICAgbWlzc2luZ29rCiAgICAgIG5vdGlmZW1wdHkKICAgICAgY29tcHJlc3MKICAgICAgc2hhcmVkc2NyaXB0cwogICAgICBwb3N0cm90YXRlCiAgICAgICAgL3Vzci9saWIvcnN5c2xvZy9yc3lzbG9nLXJvdGF0ZQogICAgICBlbmRzY3JpcHQKICAgIH0KCnBhY2thZ2VfdXBkYXRlOiB0cnVlCnBhY2thZ2VzOgotIHVuYXR0ZW5kZWQtdXBncmFkZXMKLSBnaXQKLSBqcQotIHZpbQotIG9wZW4taXNjc2kKCnJ1bmNtZDoKLSBuZXRwbGFuIGFwcGx5Ci0gdWZ3IGRpc2FibGUKLSBzeXN0ZW1jdGwgZW5hYmxlIHVuYXR0ZW5kZWQtdXBncmFkZXMKLSBzeXN0ZW1jdGwgZW5hYmxlIGlzY3NpZC5zZXJ2aWNlCi0gc3lzdGVtY3RsIHN0YXJ0IGlzY3NpZC5zZXJ2aWNlCi0gbW91bnQgYnBmZnMgLXQgYnBmIC9zeXMvZnMvYnBmCg=="
            # (2 unchanged elements hidden)
        }
        id                             = "urn:vcloud:vm:c42d32e6-b6b7-4b26-bf7e-473bc52f0c1b"
        name                           = "kubernetes-demo-worker-0"
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.infrastructure.vcd_vapp_vm.k8s_worker[1] will be updated in-place
  ~ resource "vcd_vapp_vm" "k8s_worker" {
      ~ guest_properties               = {
          ~ "user-data"      = "I2Nsb3VkLWNvbmZpZwoKYm9vdGNtZDoKLSBwcmludGYgIltSZXNvbHZlXVxuRE5TPTguOC44LjgiID4gL2V0Yy9zeXN0ZW1kL3Jlc29sdmVkLmNvbmYKLSBbc3lzdGVtY3RsLCByZXN0YXJ0LCBzeXN0ZW1kLXJlc29sdmVkXQoKcHJlc2VydmVfaG9zdG5hbWU6IGZhbHNlCmhvc3RuYW1lOiBrdWJlcm5ldGVzLWRlbW8td29ya2VyLTEKCnNzaF9wd2F1dGg6IGZhbHNlCmRpc2FibGVfcm9vdDogdHJ1ZQoKdXNlcnM6Ci0gbmFtZToga3ViZXJuZXRlcwogIGdyb3VwczogdXNlcnMsIGFkbWluCiAgbG9ja19wYXNzd2Q6IHRydWUKICBzdWRvOiBBTEw9KEFMTCkgTk9QQVNTV0Q6QUxMCiAgc2hlbGw6IC9iaW4vYmFzaAogIHNzaF9hdXRob3JpemVkX2tleXM6CiAgLSBzc2gtcnNhIEFBQUFCM056YUMxeWMyRUFBQUFEQVFBQkFBQUJnUURkR25KM3g2cThud08reFl4ZFdDb1NubGJKWEJZTUxGYkRTNzFYZnNHSjZqaHFvalRseWNPb0IwQ3psWklLbXpyS3U0Z3ByVmdxQXl1bEVYWE1TUVVJSnNYbi90czZuNXRuVnFnWjlIVEpTRkc4ZUVmam1QTDlpc1YzNGVITDRleHgrTnlpTERYYVVBM2tVZk8xZTV1ZjREcktveHFjdTVnVXlrLzduK0xKeE5neWZ6c1ZsR1RmN3VZUjAvclIvZnZWM2FNL1RFYWwwVmlkTk1nRWFiL1ZQMVcyK1Iwb1ZEMUdRR1oyWHhTV3VWZWh2SmwvTjhoK085VE5rOUdDRTl0SUxaZFl1bkZ3ZTkvb0NSWnF4MkR0YWU3dWRWQ2NjWCtHUTErejBpa3ZqdU0zVTQvRjlOS3BsdzV6SDZtOExvUWZYWkJ5MG9HTVR6czFRQ29UVUlhcG9weWJDTXFydzBMUi9KV0Y2OXB1SS9aSHMvUlRnT2k1akxwM0lwaDUyMjdiZ3hlNmVhaWVGL1BJek0zNnBQdUc0VFRiVVJOREE4cEVDQzZwaURKdFQ3MGlReEcySEVPQkNzVnpTeVJNQldBTWlFWlJtemFRN0lEOW1rZ1kyVjNRTHF6VmZST0gxSzhTSW9zS29WOXlabkFEQVc3WThRRkdmbi8yUzdyL3ppMD0gdGdkYmVmYTNAVUxYR1dQMDA3Cgp3cml0ZV9maWxlczoKLSBwYXRoOiAvZXRjL25ldHBsYW4vNTAtY2xvdWQtaW5pdC55YW1sCiAgb3duZXI6IHJvb3QKICBjb250ZW50OiB8CiAgICBuZXR3b3JrOgogICAgICB2ZXJzaW9uOiAyCiAgICAgIGV0aGVybmV0czoKICAgICAgICBldGgwOgogICAgICAgICAgbWF0Y2g6CiAgICAgICAgICAgIG5hbWU6IGVuKgogICAgICAgICAgYWRkcmVzc2VzOiBbMTAuODAuMC4xMDEvMjRdCiAgICAgICAgICBnYXRld2F5NDogMTAuODAuMC4xCiAgICAgICAgICBkaGNwNjogZmFsc2UKICAgICAgICAgIG5hbWVzZXJ2ZXJzOgogICAgICAgICAgICBhZGRyZXNzZXM6IFsxLjEuMS4xLCA4LjguOC44XQogICAgICAgICAgZGhjcDQ6IGZhbHNlCgpwYWNrYWdlX3VwZGF0ZTogdHJ1ZQpwYWNrYWdlczoKLSB1bmF0dGVuZGVkLXVwZ3JhZGVzCi0gZ2l0Ci0ganEKLSB2aW0KLSBvcGVuLWlzY3NpCgpydW5jbWQ6Ci0gbmV0cGxhbiBhcHBseQotIHVmdyBkaXNhYmxlCi0gc3lzdGVtY3RsIGVuYWJsZSB1bmF0dGVuZGVkLXVwZ3JhZGVzCi0gc3lzdGVtY3RsIGVuYWJsZSBpc2NzaWQuc2VydmljZQotIHN5c3RlbWN0bCBzdGFydCBpc2NzaWQuc2VydmljZQotIG1vdW50IGJwZmZzIC10IGJwZiAvc3lzL2ZzL2JwZgo=" -> "I2Nsb3VkLWNvbmZpZwoKYm9vdGNtZDoKLSBwcmludGYgIltSZXNvbHZlXVxuRE5TPTguOC44LjgiID4gL2V0Yy9zeXN0ZW1kL3Jlc29sdmVkLmNvbmYKLSBbc3lzdGVtY3RsLCByZXN0YXJ0LCBzeXN0ZW1kLXJlc29sdmVkXQoKcHJlc2VydmVfaG9zdG5hbWU6IGZhbHNlCmhvc3RuYW1lOiBrdWJlcm5ldGVzLWRlbW8td29ya2VyLTEKCnNzaF9wd2F1dGg6IGZhbHNlCmRpc2FibGVfcm9vdDogdHJ1ZQoKdXNlcnM6Ci0gbmFtZToga3ViZXJuZXRlcwogIGdyb3VwczogdXNlcnMsIGFkbWluCiAgbG9ja19wYXNzd2Q6IHRydWUKICBzdWRvOiBBTEw9KEFMTCkgTk9QQVNTV0Q6QUxMCiAgc2hlbGw6IC9iaW4vYmFzaAogIHNzaF9hdXRob3JpemVkX2tleXM6CiAgLSBzc2gtcnNhIEFBQUFCM056YUMxeWMyRUFBQUFEQVFBQkFBQUJnUURkR25KM3g2cThud08reFl4ZFdDb1NubGJKWEJZTUxGYkRTNzFYZnNHSjZqaHFvalRseWNPb0IwQ3psWklLbXpyS3U0Z3ByVmdxQXl1bEVYWE1TUVVJSnNYbi90czZuNXRuVnFnWjlIVEpTRkc4ZUVmam1QTDlpc1YzNGVITDRleHgrTnlpTERYYVVBM2tVZk8xZTV1ZjREcktveHFjdTVnVXlrLzduK0xKeE5neWZ6c1ZsR1RmN3VZUjAvclIvZnZWM2FNL1RFYWwwVmlkTk1nRWFiL1ZQMVcyK1Iwb1ZEMUdRR1oyWHhTV3VWZWh2SmwvTjhoK085VE5rOUdDRTl0SUxaZFl1bkZ3ZTkvb0NSWnF4MkR0YWU3dWRWQ2NjWCtHUTErejBpa3ZqdU0zVTQvRjlOS3BsdzV6SDZtOExvUWZYWkJ5MG9HTVR6czFRQ29UVUlhcG9weWJDTXFydzBMUi9KV0Y2OXB1SS9aSHMvUlRnT2k1akxwM0lwaDUyMjdiZ3hlNmVhaWVGL1BJek0zNnBQdUc0VFRiVVJOREE4cEVDQzZwaURKdFQ3MGlReEcySEVPQkNzVnpTeVJNQldBTWlFWlJtemFRN0lEOW1rZ1kyVjNRTHF6VmZST0gxSzhTSW9zS29WOXlabkFEQVc3WThRRkdmbi8yUzdyL3ppMD0gdGdkYmVmYTNAVUxYR1dQMDA3Cgp3cml0ZV9maWxlczoKLSBwYXRoOiAvZXRjL25ldHBsYW4vNTAtY2xvdWQtaW5pdC55YW1sCiAgb3duZXI6IHJvb3QKICBjb250ZW50OiB8CiAgICBuZXR3b3JrOgogICAgICB2ZXJzaW9uOiAyCiAgICAgIGV0aGVybmV0czoKICAgICAgICBldGgwOgogICAgICAgICAgbWF0Y2g6CiAgICAgICAgICAgIG5hbWU6IGVuKgogICAgICAgICAgYWRkcmVzc2VzOiBbMTAuODAuMC4xMDEvMjRdCiAgICAgICAgICBnYXRld2F5NDogMTAuODAuMC4xCiAgICAgICAgICBkaGNwNjogZmFsc2UKICAgICAgICAgIG5hbWVzZXJ2ZXJzOgogICAgICAgICAgICBhZGRyZXNzZXM6IFsxLjEuMS4xLCA4LjguOC44XQogICAgICAgICAgZGhjcDQ6IGZhbHNlCi0gcGF0aDogL2V0Yy9zeXNjdGwuZC83Ny1rdWJlcm5ldGVzLmNvbmYKICBvd25lcjogcm9vdAogIGNvbnRlbnQ6IHwKICAgIG5ldC5pcHY0LmlwX2ZvcndhcmQ9MQogICAgZnMuaW5vdGlmeS5tYXhfdXNlcl93YXRjaGVzPTY1NTM2CiAgICBmcy5pbm90aWZ5Lm1heF91c2VyX2luc3RhbmNlcz04MTkyCi0gcGF0aDogL2V0Yy9sb2dyb3RhdGUuZC9yc3lzbG9nCiAgb3duZXI6IHJvb3QKICBjb250ZW50OiB8CiAgICAvdmFyL2xvZy9zeXNsb2cKICAgIC92YXIvbG9nL21haWwuaW5mbwogICAgL3Zhci9sb2cvbWFpbC53YXJuCiAgICAvdmFyL2xvZy9tYWlsLmVycgogICAgL3Zhci9sb2cvbWFpbC5sb2cKICAgIC92YXIvbG9nL2RhZW1vbi5sb2cKICAgIC92YXIvbG9nL2tlcm4ubG9nCiAgICAvdmFyL2xvZy9hdXRoLmxvZwogICAgL3Zhci9sb2cvdXNlci5sb2cKICAgIC92YXIvbG9nL2xwci5sb2cKICAgIC92YXIvbG9nL2Nyb24ubG9nCiAgICAvdmFyL2xvZy9kZWJ1ZwogICAgL3Zhci9sb2cvbWVzc2FnZXMKICAgIHsKICAgICAgcm90YXRlIDcKICAgICAgZGFpbHkKICAgICAgbWlzc2luZ29rCiAgICAgIG5vdGlmZW1wdHkKICAgICAgY29tcHJlc3MKICAgICAgc2hhcmVkc2NyaXB0cwogICAgICBwb3N0cm90YXRlCiAgICAgICAgL3Vzci9saWIvcnN5c2xvZy9yc3lzbG9nLXJvdGF0ZQogICAgICBlbmRzY3JpcHQKICAgIH0KCnBhY2thZ2VfdXBkYXRlOiB0cnVlCnBhY2thZ2VzOgotIHVuYXR0ZW5kZWQtdXBncmFkZXMKLSBnaXQKLSBqcQotIHZpbQotIG9wZW4taXNjc2kKCnJ1bmNtZDoKLSBuZXRwbGFuIGFwcGx5Ci0gdWZ3IGRpc2FibGUKLSBzeXN0ZW1jdGwgZW5hYmxlIHVuYXR0ZW5kZWQtdXBncmFkZXMKLSBzeXN0ZW1jdGwgZW5hYmxlIGlzY3NpZC5zZXJ2aWNlCi0gc3lzdGVtY3RsIHN0YXJ0IGlzY3NpZC5zZXJ2aWNlCi0gbW91bnQgYnBmZnMgLXQgYnBmIC9zeXMvZnMvYnBmCg=="
            # (2 unchanged elements hidden)
        }
        id                             = "urn:vcloud:vm:565d581a-c5a1-4a90-ab1b-e3bab9db2961"
        name                           = "kubernetes-demo-worker-1"
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.infrastructure.vcd_vapp_vm.k8s_worker[2] will be updated in-place
  ~ resource "vcd_vapp_vm" "k8s_worker" {
      ~ guest_properties               = {
          ~ "user-data"      = "I2Nsb3VkLWNvbmZpZwoKYm9vdGNtZDoKLSBwcmludGYgIltSZXNvbHZlXVxuRE5TPTguOC44LjgiID4gL2V0Yy9zeXN0ZW1kL3Jlc29sdmVkLmNvbmYKLSBbc3lzdGVtY3RsLCByZXN0YXJ0LCBzeXN0ZW1kLXJlc29sdmVkXQoKcHJlc2VydmVfaG9zdG5hbWU6IGZhbHNlCmhvc3RuYW1lOiBrdWJlcm5ldGVzLWRlbW8td29ya2VyLTIKCnNzaF9wd2F1dGg6IGZhbHNlCmRpc2FibGVfcm9vdDogdHJ1ZQoKdXNlcnM6Ci0gbmFtZToga3ViZXJuZXRlcwogIGdyb3VwczogdXNlcnMsIGFkbWluCiAgbG9ja19wYXNzd2Q6IHRydWUKICBzdWRvOiBBTEw9KEFMTCkgTk9QQVNTV0Q6QUxMCiAgc2hlbGw6IC9iaW4vYmFzaAogIHNzaF9hdXRob3JpemVkX2tleXM6CiAgLSBzc2gtcnNhIEFBQUFCM056YUMxeWMyRUFBQUFEQVFBQkFBQUJnUURkR25KM3g2cThud08reFl4ZFdDb1NubGJKWEJZTUxGYkRTNzFYZnNHSjZqaHFvalRseWNPb0IwQ3psWklLbXpyS3U0Z3ByVmdxQXl1bEVYWE1TUVVJSnNYbi90czZuNXRuVnFnWjlIVEpTRkc4ZUVmam1QTDlpc1YzNGVITDRleHgrTnlpTERYYVVBM2tVZk8xZTV1ZjREcktveHFjdTVnVXlrLzduK0xKeE5neWZ6c1ZsR1RmN3VZUjAvclIvZnZWM2FNL1RFYWwwVmlkTk1nRWFiL1ZQMVcyK1Iwb1ZEMUdRR1oyWHhTV3VWZWh2SmwvTjhoK085VE5rOUdDRTl0SUxaZFl1bkZ3ZTkvb0NSWnF4MkR0YWU3dWRWQ2NjWCtHUTErejBpa3ZqdU0zVTQvRjlOS3BsdzV6SDZtOExvUWZYWkJ5MG9HTVR6czFRQ29UVUlhcG9weWJDTXFydzBMUi9KV0Y2OXB1SS9aSHMvUlRnT2k1akxwM0lwaDUyMjdiZ3hlNmVhaWVGL1BJek0zNnBQdUc0VFRiVVJOREE4cEVDQzZwaURKdFQ3MGlReEcySEVPQkNzVnpTeVJNQldBTWlFWlJtemFRN0lEOW1rZ1kyVjNRTHF6VmZST0gxSzhTSW9zS29WOXlabkFEQVc3WThRRkdmbi8yUzdyL3ppMD0gdGdkYmVmYTNAVUxYR1dQMDA3Cgp3cml0ZV9maWxlczoKLSBwYXRoOiAvZXRjL25ldHBsYW4vNTAtY2xvdWQtaW5pdC55YW1sCiAgb3duZXI6IHJvb3QKICBjb250ZW50OiB8CiAgICBuZXR3b3JrOgogICAgICB2ZXJzaW9uOiAyCiAgICAgIGV0aGVybmV0czoKICAgICAgICBldGgwOgogICAgICAgICAgbWF0Y2g6CiAgICAgICAgICAgIG5hbWU6IGVuKgogICAgICAgICAgYWRkcmVzc2VzOiBbMTAuODAuMC4xMDIvMjRdCiAgICAgICAgICBnYXRld2F5NDogMTAuODAuMC4xCiAgICAgICAgICBkaGNwNjogZmFsc2UKICAgICAgICAgIG5hbWVzZXJ2ZXJzOgogICAgICAgICAgICBhZGRyZXNzZXM6IFsxLjEuMS4xLCA4LjguOC44XQogICAgICAgICAgZGhjcDQ6IGZhbHNlCgpwYWNrYWdlX3VwZGF0ZTogdHJ1ZQpwYWNrYWdlczoKLSB1bmF0dGVuZGVkLXVwZ3JhZGVzCi0gZ2l0Ci0ganEKLSB2aW0KLSBvcGVuLWlzY3NpCgpydW5jbWQ6Ci0gbmV0cGxhbiBhcHBseQotIHVmdyBkaXNhYmxlCi0gc3lzdGVtY3RsIGVuYWJsZSB1bmF0dGVuZGVkLXVwZ3JhZGVzCi0gc3lzdGVtY3RsIGVuYWJsZSBpc2NzaWQuc2VydmljZQotIHN5c3RlbWN0bCBzdGFydCBpc2NzaWQuc2VydmljZQotIG1vdW50IGJwZmZzIC10IGJwZiAvc3lzL2ZzL2JwZgo=" -> "I2Nsb3VkLWNvbmZpZwoKYm9vdGNtZDoKLSBwcmludGYgIltSZXNvbHZlXVxuRE5TPTguOC44LjgiID4gL2V0Yy9zeXN0ZW1kL3Jlc29sdmVkLmNvbmYKLSBbc3lzdGVtY3RsLCByZXN0YXJ0LCBzeXN0ZW1kLXJlc29sdmVkXQoKcHJlc2VydmVfaG9zdG5hbWU6IGZhbHNlCmhvc3RuYW1lOiBrdWJlcm5ldGVzLWRlbW8td29ya2VyLTIKCnNzaF9wd2F1dGg6IGZhbHNlCmRpc2FibGVfcm9vdDogdHJ1ZQoKdXNlcnM6Ci0gbmFtZToga3ViZXJuZXRlcwogIGdyb3VwczogdXNlcnMsIGFkbWluCiAgbG9ja19wYXNzd2Q6IHRydWUKICBzdWRvOiBBTEw9KEFMTCkgTk9QQVNTV0Q6QUxMCiAgc2hlbGw6IC9iaW4vYmFzaAogIHNzaF9hdXRob3JpemVkX2tleXM6CiAgLSBzc2gtcnNhIEFBQUFCM056YUMxeWMyRUFBQUFEQVFBQkFBQUJnUURkR25KM3g2cThud08reFl4ZFdDb1NubGJKWEJZTUxGYkRTNzFYZnNHSjZqaHFvalRseWNPb0IwQ3psWklLbXpyS3U0Z3ByVmdxQXl1bEVYWE1TUVVJSnNYbi90czZuNXRuVnFnWjlIVEpTRkc4ZUVmam1QTDlpc1YzNGVITDRleHgrTnlpTERYYVVBM2tVZk8xZTV1ZjREcktveHFjdTVnVXlrLzduK0xKeE5neWZ6c1ZsR1RmN3VZUjAvclIvZnZWM2FNL1RFYWwwVmlkTk1nRWFiL1ZQMVcyK1Iwb1ZEMUdRR1oyWHhTV3VWZWh2SmwvTjhoK085VE5rOUdDRTl0SUxaZFl1bkZ3ZTkvb0NSWnF4MkR0YWU3dWRWQ2NjWCtHUTErejBpa3ZqdU0zVTQvRjlOS3BsdzV6SDZtOExvUWZYWkJ5MG9HTVR6czFRQ29UVUlhcG9weWJDTXFydzBMUi9KV0Y2OXB1SS9aSHMvUlRnT2k1akxwM0lwaDUyMjdiZ3hlNmVhaWVGL1BJek0zNnBQdUc0VFRiVVJOREE4cEVDQzZwaURKdFQ3MGlReEcySEVPQkNzVnpTeVJNQldBTWlFWlJtemFRN0lEOW1rZ1kyVjNRTHF6VmZST0gxSzhTSW9zS29WOXlabkFEQVc3WThRRkdmbi8yUzdyL3ppMD0gdGdkYmVmYTNAVUxYR1dQMDA3Cgp3cml0ZV9maWxlczoKLSBwYXRoOiAvZXRjL25ldHBsYW4vNTAtY2xvdWQtaW5pdC55YW1sCiAgb3duZXI6IHJvb3QKICBjb250ZW50OiB8CiAgICBuZXR3b3JrOgogICAgICB2ZXJzaW9uOiAyCiAgICAgIGV0aGVybmV0czoKICAgICAgICBldGgwOgogICAgICAgICAgbWF0Y2g6CiAgICAgICAgICAgIG5hbWU6IGVuKgogICAgICAgICAgYWRkcmVzc2VzOiBbMTAuODAuMC4xMDIvMjRdCiAgICAgICAgICBnYXRld2F5NDogMTAuODAuMC4xCiAgICAgICAgICBkaGNwNjogZmFsc2UKICAgICAgICAgIG5hbWVzZXJ2ZXJzOgogICAgICAgICAgICBhZGRyZXNzZXM6IFsxLjEuMS4xLCA4LjguOC44XQogICAgICAgICAgZGhjcDQ6IGZhbHNlCi0gcGF0aDogL2V0Yy9zeXNjdGwuZC83Ny1rdWJlcm5ldGVzLmNvbmYKICBvd25lcjogcm9vdAogIGNvbnRlbnQ6IHwKICAgIG5ldC5pcHY0LmlwX2ZvcndhcmQ9MQogICAgZnMuaW5vdGlmeS5tYXhfdXNlcl93YXRjaGVzPTY1NTM2CiAgICBmcy5pbm90aWZ5Lm1heF91c2VyX2luc3RhbmNlcz04MTkyCi0gcGF0aDogL2V0Yy9sb2dyb3RhdGUuZC9yc3lzbG9nCiAgb3duZXI6IHJvb3QKICBjb250ZW50OiB8CiAgICAvdmFyL2xvZy9zeXNsb2cKICAgIC92YXIvbG9nL21haWwuaW5mbwogICAgL3Zhci9sb2cvbWFpbC53YXJuCiAgICAvdmFyL2xvZy9tYWlsLmVycgogICAgL3Zhci9sb2cvbWFpbC5sb2cKICAgIC92YXIvbG9nL2RhZW1vbi5sb2cKICAgIC92YXIvbG9nL2tlcm4ubG9nCiAgICAvdmFyL2xvZy9hdXRoLmxvZwogICAgL3Zhci9sb2cvdXNlci5sb2cKICAgIC92YXIvbG9nL2xwci5sb2cKICAgIC92YXIvbG9nL2Nyb24ubG9nCiAgICAvdmFyL2xvZy9kZWJ1ZwogICAgL3Zhci9sb2cvbWVzc2FnZXMKICAgIHsKICAgICAgcm90YXRlIDcKICAgICAgZGFpbHkKICAgICAgbWlzc2luZ29rCiAgICAgIG5vdGlmZW1wdHkKICAgICAgY29tcHJlc3MKICAgICAgc2hhcmVkc2NyaXB0cwogICAgICBwb3N0cm90YXRlCiAgICAgICAgL3Vzci9saWIvcnN5c2xvZy9yc3lzbG9nLXJvdGF0ZQogICAgICBlbmRzY3JpcHQKICAgIH0KCnBhY2thZ2VfdXBkYXRlOiB0cnVlCnBhY2thZ2VzOgotIHVuYXR0ZW5kZWQtdXBncmFkZXMKLSBnaXQKLSBqcQotIHZpbQotIG9wZW4taXNjc2kKCnJ1bmNtZDoKLSBuZXRwbGFuIGFwcGx5Ci0gdWZ3IGRpc2FibGUKLSBzeXN0ZW1jdGwgZW5hYmxlIHVuYXR0ZW5kZWQtdXBncmFkZXMKLSBzeXN0ZW1jdGwgZW5hYmxlIGlzY3NpZC5zZXJ2aWNlCi0gc3lzdGVtY3RsIHN0YXJ0IGlzY3NpZC5zZXJ2aWNlCi0gbW91bnQgYnBmZnMgLXQgYnBmIC9zeXMvZnMvYnBmCg=="
            # (2 unchanged elements hidden)
        }
        id                             = "urn:vcloud:vm:b9a5924d-327d-4453-9ff7-47105bac3de9"
        name                           = "kubernetes-demo-worker-2"
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.kubernetes.local_sensitive_file.kubeconfig_file will be created
  + resource "local_sensitive_file" "kubeconfig_file" {
      + content              = (sensitive value)
      + directory_permission = "0700"
      + file_permission      = "0600"
      + filename             = "kubeconfig"
      + id                   = (known after apply)
    }

  # module.kubernetes.null_resource.k8s_cilium_install must be replaced
-/+ resource "null_resource" "k8s_cilium_install" {
      ~ id       = "6258389488070838576" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "on_new_cilium_version"     = "v1.12.3" -> "v1.12.4"
          ~ "on_new_k3s_version"        = "v1.24.7+k3s1" -> "v1.24.8+k3s1"
            # (1 unchanged element hidden)
        }
    }

  # module.kubernetes.null_resource.k8s_cilium_status must be replaced
-/+ resource "null_resource" "k8s_cilium_status" {
      ~ id       = "8231247681956109520" -> (known after apply)
      ~ triggers = {
          - "always_run" = "2022-12-01T11:10:18Z"
        } -> (known after apply) # forces replacement
    }

  # module.kubernetes.module.k3s.data.http.k3s_installer will be read during apply
  # (config refers to values not yet known)
 <= data "http" "k3s_installer" {
      + body             = (known after apply)
      + id               = (known after apply)
      + response_headers = (known after apply)
      + url              = (known after apply)
    }

  # module.kubernetes.module.k3s.data.http.k3s_version will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "http" "k3s_version" {
      + body             = (known after apply)
      + id               = (known after apply)
      + response_headers = (known after apply)
      + url              = "https://update.k3s.io/v1-release/channels"
    }

  # module.kubernetes.module.k3s.null_resource.agents_annotation["k8s-worker-0|dcs.kubernetes.io/release"] must be replaced
-/+ resource "null_resource" "agents_annotation" {
      ~ id       = "4973313167930177016" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "on_value_changes" = "'v2.4.1'" -> "'v2.4.2'"
            # (4 unchanged elements hidden)
        }
    }

  # module.kubernetes.module.k3s.null_resource.agents_annotation["k8s-worker-1|dcs.kubernetes.io/release"] must be replaced
-/+ resource "null_resource" "agents_annotation" {
      ~ id       = "5019396954875811412" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "on_value_changes" = "'v2.4.1'" -> "'v2.4.2'"
            # (4 unchanged elements hidden)
        }
    }

  # module.kubernetes.module.k3s.null_resource.agents_annotation["k8s-worker-2|dcs.kubernetes.io/release"] must be replaced
-/+ resource "null_resource" "agents_annotation" {
      ~ id       = "1520083646120774343" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "on_value_changes" = "'v2.4.1'" -> "'v2.4.2'"
            # (4 unchanged elements hidden)
        }
    }

  # module.kubernetes.module.k3s.null_resource.agents_install["k8s-worker-0"] must be replaced
-/+ resource "null_resource" "agents_install" {
      ~ id       = "2785039167403387815" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "on_new_version"       = "v1.24.7+k3s1" -> "v1.24.8+k3s1"
            # (1 unchanged element hidden)
        }
    }

  # module.kubernetes.module.k3s.null_resource.agents_install["k8s-worker-1"] must be replaced
-/+ resource "null_resource" "agents_install" {
      ~ id       = "3969423651348004298" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "on_new_version"       = "v1.24.7+k3s1" -> "v1.24.8+k3s1"
            # (1 unchanged element hidden)
        }
    }

  # module.kubernetes.module.k3s.null_resource.agents_install["k8s-worker-2"] must be replaced
-/+ resource "null_resource" "agents_install" {
      ~ id       = "3879558826205646137" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "on_new_version"       = "v1.24.7+k3s1" -> "v1.24.8+k3s1"
            # (1 unchanged element hidden)
        }
    }

  # module.kubernetes.module.k3s.null_resource.servers_annotation["k8s-server-0|dcs.kubernetes.io/release"] must be replaced
-/+ resource "null_resource" "servers_annotation" {
      ~ id       = "1679608701278940124" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "on_value_changes" = "'v2.4.1'" -> "'v2.4.2'"
            # (4 unchanged elements hidden)
        }
    }

  # module.kubernetes.module.k3s.null_resource.servers_annotation["k8s-server-1|dcs.kubernetes.io/release"] must be replaced
-/+ resource "null_resource" "servers_annotation" {
      ~ id       = "8550032662401960497" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "on_value_changes" = "'v2.4.1'" -> "'v2.4.2'"
            # (4 unchanged elements hidden)
        }
    }

  # module.kubernetes.module.k3s.null_resource.servers_annotation["k8s-server-2|dcs.kubernetes.io/release"] must be replaced
-/+ resource "null_resource" "servers_annotation" {
      ~ id       = "376322403311832429" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "on_value_changes" = "'v2.4.1'" -> "'v2.4.2'"
            # (4 unchanged elements hidden)
        }
    }

  # module.kubernetes.module.k3s.null_resource.servers_install["k8s-server-0"] must be replaced
-/+ resource "null_resource" "servers_install" {
      ~ id       = "1699797033353257846" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "on_new_version"       = "v1.24.7+k3s1" -> "v1.24.8+k3s1"
            # (1 unchanged element hidden)
        }
    }

  # module.kubernetes.module.k3s.null_resource.servers_install["k8s-server-1"] must be replaced
-/+ resource "null_resource" "servers_install" {
      ~ id       = "7908976907538464241" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "on_new_version"       = "v1.24.7+k3s1" -> "v1.24.8+k3s1"
            # (1 unchanged element hidden)
        }
    }

  # module.kubernetes.module.k3s.null_resource.servers_install["k8s-server-2"] must be replaced
-/+ resource "null_resource" "servers_install" {
      ~ id       = "5786231730004158294" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "on_new_version"       = "v1.24.7+k3s1" -> "v1.24.8+k3s1"
            # (1 unchanged element hidden)
        }
    }

Plan: 15 to add, 9 to change, 14 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @brunograz, Action: `pull_request`, Workflow: `Pull Request`*